{"url": "https://www.cnbc.com/2025/05/28/elon-musk-says-trumps-spending-bill-undermines-the-work-doge-has-been-doing.html", "title": "Musk says Trump's big bill undermines DOGE; president counters with political reality", "body": "Elon Musk criticized President Donald Trump's signature spending bill that recently made it through a House vote, saying it counters the work he's been doing to reduce wasteful government spending.\n\nIn an interview to be aired June 1 on \"CBS Sunday Morning,\" the richest person in the world and the head of the Department of Government Efficiency advisory board said the \"big, beautiful bill\" will not help the nation's finances.\n\n\"I was, like, disappointed to see the massive spending bill, frankly, which increases the budget deficit, not just decrease it, and undermines the work that the DOGE team is doing,\" Musk said in a clip the program shared on social media platform X.\n\nTrump responded Wednesday to the critique from his top campaign donor.\n\n\n\n\"We had to get it through the House,\" Trump said of the massive spending bill. \"The House was, we have no Democrats\" who supported the package.\n\n\"I'm not happy about certain aspects of it,\" the president said, \"but I'm thrilled by other aspects of it. That's the way they go.\"\n\nThe sweeping One Big Beautiful Bill Act is projected to raise the federal budget deficit by $3.8 trillion over the next 10 years, according to the Congressional Budget Office, a nonpartisan agency that conducts economic analysis for Congress. The deficit is on track in 2025 to run close to $2 trillion, with the national debt now at $36.2 trillion.\n\n\"I think a bill can be big or it could be beautiful, but I don't know if it could be both,\" Musk said in the CBS clip.\n\nTrump and congressional Republicans counter that the bill reduces spending in key areas and will generate enough growth to compensate for the tax reductions. The legislation, though, is expected to face strong resistance in the Senate.\n\nFor his part, Musk has pulled back his DOGE work, saying he plans to focus on running his companies, which include X, Tesla and SpaceX. Musk had been a frequent presence in the White House since Trump's election.\n\n\"DOGE is just becoming the whipping boy for everything,\" Musk said in an interview Tuesday with The Washington Post. \"So, like, something bad would happen anywhere, and we would get blamed for it even if we had nothing to do with it.\"\n\nHouse Speaker Mike Johnson, R-La., on Wednesday praised DOGE and Musk's work.\n\n\"The House is eager and ready to act on DOGE's findings so we can deliver even more cuts to big government that President [Donald] Trump wants and the American people demand,\" Johnson wrote in a post on X.\n\nBefore the House can vote to approve the cuts, however, the White House needs to formally request permission to cancel some of the money that Congress set out for specific programs.\n\n\"When the White House sends its rescissions package to the House, we will act quickly by passing legislation to codify the cuts,\" said Johnson, using the term for White House requests not to spend money that Congress authorized.\n\nDespite Johnson's upbeat tone, many of Musk and DOGE's drastic cuts to government grant programs and the federal workforce have been met with resistance in Congress, including from Republicans whose districts have been hit by the cuts and mass layoffs.\n\nDOGE says it has saved $170 billion in taxpayer money since it began in January by targeting waste and redundancy in government.\n\nBut what counts as wasteful spending has proven to be a deeply divisive question.\n\nIn February and March alone, DOGE-related moves were responsible for some 275,000 government layoffs, according to Challenger, Gray & Christmas, a consultancy firm.\n\nMusk's work with Trump, and his frequently incendiary political rhetoric, have also inspired a backlash and widespread protests against his autos business, Tesla .\n\n\"People were burning Teslas. Why would you do that? That's really uncool,\" Musk told the Post.\n\n— CNBC's Erin Doherty and Lora Kolodny contributed.", "publish_ts": 1748390400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/27/consumer-confidence-for-may-was-much-stronger-than-expected-on-optimism-for-trade-deals.html", "title": "Consumer confidence for May was much stronger than expected on optimism for trade deals", "body": "Consumer optimism got a much-needed boost in May on hopes for trade peace between the U.S. and China, according to a survey Tuesday.\n\nThe Conference Board's Consumer Confidence Index leaped to 98.0, a 12.3-point increase from April and much better than the Dow Jones consensus estimate for 86.0.\n\nMuch of the positive sentiment, according to board officials, came from developments in the U.S.-China trade impasse, most notably President Donald Trump's halting of the most severe tariffs on May 12.\n\n\"The rebound was already visible before the May 12 US-China trade deal but gained momentum afterwards,\" said Stephanie Guichard, the Conference Board's senior economist for global indicators.\n\nMay's rebound followed five straight months of declines. Consumers and investors had grown sour on economic prospects amid the intensifying trade war that Trump has launched against U.S. global trading partners, with China a particular target.\n\nHowever, the two sides reached a truce in early May, marking the second major walk-back of Trump's so-called reciprocal tariffs since he levied them in his April 2 \"liberation day\" announcement.\n\nOther board sentiment indicators also increased.\n\nThe present situation index increased to 135.9, up 4.8 points, and the expectations index posted a major surge to 72.8, a 17.4-point gain. Investors also showed more optimism, with 44% now expecting stocks to be higher over the next 12 months, up 6.4 percentage points from April.\n\nViews on the labor market also improved, with 19.2% of respondents expecting more jobs to be available in the next six months, compared with 13.9% in April. At the same time, 26.6% expect fewer jobs, down from 32.4%. However, the level of respondents saying jobs were \"plentiful\" edged higher to just 31.8%, while those saying employment was \"hard to get\" increased to 18.6%, up 1.1 percentage points.\n\nSurvey officials said sentiment improved across age, income and political affiliation, though noting that the \"strongest improvements\" came from Republicans.", "publish_ts": 1748304000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/27/trump-hails-positive-steps-in-us-eu-trade-talks-as-markets-await-deal.html", "title": "Trump hails 'positive' step in U.S.-EU trade negotiations as markets hope for a deal", "body": "U.S. President Donald Trump gestures at the annual National Memorial Day Observance in the Memorial Amphitheater, at Arlington National Cemetery in Arlington, Virginia, U.S., May 26, 2025.\n\nU.S. President Donald Trump said Tuesday he was monitoring \"positive\" steps in trade talks with the European Union, after he agreed to delay a 50% tariff on goods from the bloc until July 9.\n\n\"I have just been informed that the E.U. has called to quickly establish meeting dates,\" Trump wrote in a post on the Truth Social platform.\n\n\"This is a positive event, and I hope that they will, FINALLY, like my same demand to China, open up the European Nations for Trade with the United States of America.\"\n\nTrump also said Tuesday that the EU had been \"slow walking\" in negotiations with the White House over a trade deal.\n\nThe sudden prospect of even greater tariffs on one of the U.S.' biggest trade partners rattled markets when it was threatened by Trump last Friday. In a post last week, Trump said discussions with the EU were \"going nowhere.\"\n\nHowever, sentiment turned positive on Tuesday amid hopes of a breakthrough. European Commission President Ursula von der Leyen said in a post on X over the weekend that the EU was \"ready to advance talks swiftly and decisively,\" while European Trade Commissioner Maros Sefcovic said Monday that he had \"good calls\" with U.S. Commerce Secretary Howard Lutnick.\n\nEurope's regional Stoxx 600 index slightly extended gains after Trump's comments on Tuesday, last trading up 0.55% on the previous session, while U.S. markets opened broadly higher.\n\nThe 27-member alliance was hit with a 20% tariff on April 2 as part of Trump's \"reciprocal\" tariff strategy, which was then cut for almost all trading partners to 10% for 90 days. Concurrent U.S. duties on autos, steel and aluminum are also impacting the bloc's exporters.\n\nEU officials have repeatedly stressed that they want to reach a deal with the White House, but that this will not come at any cost. The European Commission, the EU's executive arm, earlier this month launched a consultation on tariff countermeasures targeting U.S. imports worth 95 billion euros ($107.4 billion) if a deal is not reached.\n\nCNBC has contacted the European Commission for comment.\n\nOn May 8, the U.S. unveiled the outline of a trade deal with the U.K., the first such agreement under the latest Trump administration, although businesses say they are awaiting further details. The deal maintains a 10% baseline tariff on U.K. imports to the U.S., suggesting other countries will face a similar rate at a minimum.\n\nTrump has generally struck a favorable tone toward the U.K. due to its more balanced trade relationship in goods with the U.S. He has accused the EU, however — with which it has a deficit in goods — of treating the U.S. unfairly. EU-U.S. trade is roughly balanced when accounting for both goods and services, according to EU figures.", "publish_ts": 1748304000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/23/trump-greenlights-nippon-merger-with-us-steel.html", "title": "Trump clears Nippon merger with U.S. Steel", "body": "A water tower at the U.S. Steel Corp. Edgar Thomson Works steel mill in Braddock, Pennsylvania, on Sept. 4, 2024.\n\nPresident Donald Trump on Friday cleared the merger of U.S. Steel and Nippon Steel, after the Japanese steelmaker's previous bid to acquire its U.S. rival had been blocked on national security grounds.\n\n\"This will be a planned partnership between United States Steel and Nippon Steel, which will create at least 70,000 jobs, and add $14 Billion Dollars to the U.S. Economy,\" Trump said in a post on his social media platform Truth Social.\n\nU.S. Steel's headquarters will remain in Pittsburgh and the bulk of the investment will take place over the next 14 months, the president said. U.S. Steel shares surged more than 20% to close at $52.01 per share after Trump's announcement.\n\nPresident Joe Biden blocked Nippon Steel from purchasing U.S. Steel for $14.9 billion in January, citing national security concerns. Biden said at the time that the acquisition would create a risk to supply chains that are critical for the U.S.\n\nTrump, however, ordered a new review of the proposed acquisition in April, directing the Committee on Foreign Investment in the United States to determine \"whether further action in this matter may be appropriate.\"\n\nTrump said he would hold a rally at U.S. Steel in Pittsburgh on May 30.", "publish_ts": 1747958400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/16/the-low-end-consumer-is-about-to-feel-the-pinch-as-trump-restarts-student-loan-collections.html", "title": "The low-end consumer is about to feel the pinch as Trump restarts student loan collections", "body": "Wall Street is warning that the U.S. Department of Education's crack down on student loan repayments may take billions of dollars out of consumers' pockets and hit low income Americans particularly hard.\n\nThe department has restarted collections on defaulted student loans under President Donald Trump this month. For first time in around five years, borrowers who haven't kept up with their bills could see their wages taken or face other punishments.\n\nUsing a range of interest rates and lengths of repayment plans, JPMorgan estimated that disposable personal income could be collectively cut by between $3.1 billion and $8.5 billion every month due to collections, according to Murat Tasci, senior U.S. economist at the bank and a Cleveland Federal Reserve alum.\n\nIf that all surfaced in one quarter, collections on defaulted and seriously delinquent loans alone would slash between 0.7% and 1.8% from disposable personal income year-over-year, he said.\n\nThis policy change may strain consumers who are already stressed out by Trump's tariff plan and high prices from years of runaway inflation. These factors can help explain why closely followed consumer sentiment data compiled by the University of Michigan has been hitting some of its lowest levels in its seven-decade history in the past two months.\n\n\"You have a number of these pressure points rising,\" said Jeffrey Roach, chief economist at LPL Financial. \"Perhaps in aggregate, it's enough to quash some of these spending numbers.\"\n\nBank of America said this push to collect could particularly weigh on groups that are on more precarious financial footing. \"We believe resumption of student loan payments will have knock-on effects on broader consumer finances, most especially for the subprime consumer segment,\" Bank of America analyst Mihir Bhatia wrote to clients.", "publish_ts": 1747353600000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/16/consumer-sentiment-may-inflation-expectations-tariffs.html", "title": "Consumer sentiment slides to second-lowest on record as inflation expectations jump after tariffs", "body": "A woman walks in an aisle of a Walmart supermarket in Houston, Texas, on May 15, 2025.\n\nU.S. consumers are becoming increasingly worried that tariffs will lead to higher inflation, according to a University of Michigan survey released Friday.\n\nThe index of consumer sentiment dropped to 50.8, down from 52.2 in April, in the preliminary reading for May. That is the second-lowest reading on record, behind June 2022.\n\nThe outlook for price changes also moved in the wrong direction. Year-ahead inflation expectations rose to 7.3% from 6.5% last month, while long-term inflation expectations ticked up to 4.6% from 4.4%.\n\nHowever, the majority of the survey was completed before the U.S. and China announced a 90-day pause on most tariffs between the two countries. The trade situation appears to be a key factor weighing on consumer sentiment.\n\n\"Tariffs were spontaneously mentioned by nearly three-quarters of consumers, up from almost 60% in April; uncertainty over trade policy continues to dominate consumers' thinking about the economy,\" Joanne Hsu, director of the Surveys of Consumers, said in the release.\n\nInflation expectations are closely watched by investors and policymakers. Federal Reserve Chair Jerome Powell has said the central bank wants to make sure long-term inflation expectations do not rise because of tariffs before resuming rate cuts.\n\nEven with the pauses on import levies against China and other countries, the effective tariff rate for goods entering the United States is still significantly higher today than it was before President Donald Trump's inauguration in January. Economists on both sides of the aisle mostly agree that tariffs could lead to a short-term rise in prices, though the extent of that increase and whether it would fuel long-term inflation remains unclear.\n\nRecent inflation data has not shown a tariff bump, as both the consumer price index and producer price index for April came in below consensus estimates.\n\nA final consumer sentiment index for the month is slated to be released on May 30, and will likely be closely watched to see if the tariff pause led to an improvement in sentiment.", "publish_ts": 1747353600000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/15/jpmorgan-chase-ceo-jamie-dimon-says-recession-is-still-on-the-table-for-us-.html", "title": "JPMorgan Chase CEO Jamie Dimon says recession is still on the table for U.S.", "body": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, March 12, 2025.\n\nWall Street titan Jamie Dimon said Thursday that a recession is still a serious possibility for the United States, even after the recent rollback of tariffs on China.\n\n\"If there's a recession, I don't know how big it will be or how long it will last. Hopefully we'll avoid it, but I wouldn't take it off the table at this point,\" the JPMorgan Chase CEO said in an interview with Bloomberg Television.\n\nSpecifically, Dimon said he would defer to his bank's economists, who put recession odds at close to a toss-up. Michael Feroli, the firm's chief U.S. economist, said in a note to clients on Tuesday that the recession outlook is \"still elevated, but now below 50%.\"\n\nDimon's comments come less than a week after the U.S. and China announced that they were sharply reducing tariffs on one another for 90 days. The U.S. has also implemented a 90-day pause for many tariffs on other nations.\n\nThursday's comments mark a change for Dimon, who said last month before the China truce that a recession was likely.\n\nHe also said there is still \"uncertainty\" on the tariff front but the pauses are a positive for the economy and market.\n\n\"I think the right thing to do is to back off some of that stuff and engage in conversation,\" Dimon said.\n\nHowever, even with the tariff pauses, the import taxes on goods entering the United States are now sharply higher than they were last year and could cause economic damage, according to Dimon.\n\n\"Even at this level, you see people holding back on investment and thinking through what they want to do,\" Dimon said.\n\n— CNBC's Michael Bloom contributed reporting.", "publish_ts": 1747267200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/15/watch-fed-chair-jerome-powell-deliver-live-remarks-on-policy-review.html", "title": "Watch Fed Chair Jerome Powell deliver live remarks on policy review", "body": "[The stream is slated to start at 8:40 a.m. ET. Please refresh the page if you do not see a player above at that time.]\n\nFederal Reserve Chair Jerome Powell speaks Thursday morning to the Thomas Laubach Research Conference.\n\nThe topic of Powell's presentation will be the review the central bank is conducting this year of its policy framework. Conducted every five years, the framework review helps provide officials with a blueprint for monetary policy ahead.\n\nFollowing the last review, the Fed outlined a policy that became known as flexible average inflation targeting. The move was a stated intent to allow inflation to run slightly over the central bank's 2% target for a period of time in the interest of providing full and inclusive employment across the economy, including for race and gender.\n\nHowever, a year later inflation began to escalate, eventually hitting a 40-year high and forcing the Fed into a series of aggressive interest rate increases.\n\nRead more:\n\nFed holds rates steady as it notes rising uncertainty and stagflation risk\n\nPowell may have a hard time avoiding Trump's 'Too Late' label\n\nFed's Powell indicates tariffs could pose a challenge between controlling inflation, boosting growth\n\nSubscribe to CNBC on YouTube.", "publish_ts": 1747267200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/13/cpi-inflation-april-2025.html", "title": "Annual inflation rate hit 2.3% in April, less than expected and lowest since 2021", "body": "watch now\n\nInflation was slightly lower than expected in April as President Donald Trump's tariffs just began hitting the slowing U.S. economy, according to a Labor Department report Tuesday. The consumer price index, which measures the costs for a broad range of goods and services, rose a seasonally adjusted 0.2% for the month, putting the 12-month inflation rate at 2.3%, its lowest since February 2021, the Bureau of Labor Statistics said. The monthly reading was in line with the Dow Jones consensus estimate while the 12-month was a bit below the forecast for 2.4%. Excluding volatile food and energy prices, the core CPI also increased 0.2% for the month, while the year-over-year level was 2.8%. The forecast was for 0.3% and 2.8%, respectively.\n\nThe monthly readings were a bit higher than in March though price increases remain well off their highs of three years ago. Markets reacted little to the news, with stock futures pointing flat to slightly lower and Treasury yields mixed. \"Good news on inflation, and we need it given inflation shocks from tariffs are on their way,\" said Robert Frick, corporate economist at Navy Federal Credit Union. \"Non-tariffed goods are still in the pipeline, and perhaps some importers have absorbed their tariff costs for now.\" Shelter prices again were the main culprit in pushing up the inflation gauge. The category, which makes about one-third of the index weighting, increased 0.3% in April, accounting for more than half the overall move, according to the BLS.", "publish_ts": 1747094400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/13/german-business-leaders-tell-new-government-its-time-to-deliver.html", "title": "'The Germans are back:' Business leaders tell government it's time to deliver", "body": "TEGERNSEE, Germany — Top German business leaders, economists and politicians descended onto a small, picturesque Bavarian town situated next to the iconic Tegernsee lake last week to share their hopes and discuss what's at stake for the new government. Buoyed by recent positive market sentiment for Europe's largest economy, attendees at the summit were united in their call for the new administration to step up and honour campaign promises. Any missteps would likely not be tolerated, with some business leaders warning the government cannot allow itself a \"lazy summer.\" Despite rain and low hanging clouds providing a somewhat dreary backdrop to the event, which has been dubbed the \"Davos of Germany,\" the promise of new beginnings enveloped the summit and the atmosphere was buzzing with excitement for potential changes the newly-appointed Chancellor Friedrich Merz could initiate.\n\nThe view across the Tegernsee from the Ludwig Erhard Summit Sophie Kiderlin, CNBC\n\nBig expectations for the government were commonplace, with concerns about Germany's struggling economy and recent political turmoil seemingly having faded into the background. The German DAX index is currently up over 18% since the beginning of this year, frequently hitting record highs in recent months. The German economy has however been in stagnation territory for over two years now, with tensions over economic, fiscal and budget policy in the previous ruling coalition and its eventual breakup continuing to weigh on expectations. \"There are very high hopes now on the new government,\" Patrick Trutwein, chief risk officer and chief operating officer at the IKB Deutsche Industriebank AG, said during a panel moderated by CNBC's Annette Weisbach. He said he was feeling positive about Germany's future considering the announcement of the major fiscal package enshrined in Germany's constitution, as well as further potential reforms ahead and \"an economy that's pretty robust and can build on its own ... productivity and competencies.\" Matthias Voelkel, CEO of Boerse Stuttgart Group, was among those feeling hopeful. \"If we look ahead and if they [the new government] do the right thing, I'm optimistic,\" he told CNBC. Audi CEO Gernot Döllner meanwhile said in a fireside chat that he was hopeful that the new government would \"send an impulse into the German economy.\" The mood was also upbeat in Germany's auto sector, which has long been struggling with competition from China, pressures from the transition to electric vehicles and has recently been hit by U.S. tariffs. \"The Germans are back,\" Hildegard Müller, president of the German Association of the Automotive Industry, told CNBC's Weisbach Friday. \"We are competitive,\" she added.\n\nA talk at the Ludwig Erhard Summit. Sophie Kiderlin, CNBC\n\nBut amid the positive buzz, it was clear that observers are keeping a close eye on the governments every move. \"This new government in Germany cannot allow itself a political lazy summer, I'm sorry, they've got to work and they've got to work hard,\" said Karl-Theodor zu Guttenberg, chairman of Spitzberg Partners and former German politician. Or as Veronika Grimm, member of the German Council of Economic Experts, told CNBC: \"A lot lies ahead for the government.\"\n\nOveral the message was clear: Germany needs to get its act together. Alexander Horn, general manager of Eli Lilly 's Germany arm — Lilly Germany — said the business strongly welcomes the new government's goals, but won't tolerate any caveats. \"Specifically we expect that the declarations of intent that are in the coalition agreement will be implemented quickly, speed plays an enormously big role,\" he said during a panel, according to a CNBC translation. Boerse Stuttgart Group's Voelkel indicated his optimism relied on action from the government, saying he was looking for moves towards \"less bureaucracy, less anti-growth regulation, more innovation and particularly strengthening investment.\"\n\nwatch now", "publish_ts": 1747094400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/12/tariff-receipts-topped-16-billion-in-april-a-record-that-helped-cut-the-budget-deficit.html", "title": "Tariff receipts topped $16 billion in April, a record that helped cut the budget deficit", "body": "Shipping containers are seen at the port of Oakland, as trade tensions continued over U.S. tariffs with China, in Oakland, California, on May 12, 2025.\n\nReceipts from U.S. tariffs hit a record level in April as revenue from President Donald Trump's trade war started kicking in.\n\nCustoms duties totaled $16.3 billion for the month, some 86% above the $8.75 billion collected during March and more than double the $7.1 billion a year ago, the Treasury Department reported Monday.\n\nThat brought the year-to-date total for the duties up to $63.3 billion and more than 18% ahead of the same period in 2024. Trump instituted 10% across-the-board tariffs on U.S. imports starting April 2, which came on top of other select duties he had leveled previously.\n\nWhile the U.S. is still running a massive budget deficit, the influx in tariffs helped shave some of the imbalance for April, a month in which the Treasury generally runs a surplus because of the income tax filing deadline hitting mid-month.\n\nThe surplus totaled $258.4 billion for the month, up 23% from the same period a year ago. That cut the fiscal year-to-date total to $1.05 trillion, which is still 13% higher than a year ago.\n\nAlso on an annual basis, receipts rose 10% in April from 2024, while outlays declined 4%. Year to date, receipts are up 5%, while expenditures have risen 9%.\n\nHigh interest rates are still posing a budgetary burden. Net interest on the $36.2 trillion national debt totaled $89 billion in April, higher than every other category except Social Security. For the fiscal year, net interest has run to $579 billion, also second highest of any outlay.", "publish_ts": 1747008000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/12/bessent-sees-tariff-agreement-as-progress-in-strategic-decoupling-with-china.html", "title": "Bessent sees tariff agreement as progress in 'strategic' decoupling with China", "body": "Treasury Secretary Scott Bessent said Monday that the trade agreement reached over the weekend represents another stage in the U.S. shaking its reliance on Chinese products.\n\nThough the U.S. \"decoupling\" itself from its need for cheap imports from China has been discussed for years, the process has been a slow one and unlikely to ever mean a complete break.\n\nHowever, Bessent said there are now specific elements of decoupling in place that are vital to U.S. interests. The U.S. imported nearly $440 billion in goods from China in 2024, running a $295.4 billion trade deficit.\n\n\"We do not want a generalized decoupling from China,\" he said during an interview on CNBC's \"Squawk Box.\" \"But what we do want is a decoupling for strategic necessities, which we were unable to obtain during Covid and we realized that efficient supply chains were not resilient supply chains.\"\n\nWhen the pandemic struck in 2020, demand in the U.S. shifted from one reliant more on services to a greater focus on goods. That meant greater difficulty in obtaining material for multiple products including big-ticket appliances and automobiles. The technology industry, with its reliance on semiconductors, was also hit. What followed was an inflation surge in the U.S. not seen in more than 40 years.\n\nThe details of the U.S.-China pact are still sketchy, but U.S. officials have said so-called reciprocal tariffs will be suspended though broad-based 10% duties will remain in effect.\n\n\"We are going to create our own steel. [Tariffs] protect our steel industry. They work on critical medicines, on semiconductors,\" Bessent said. \"We are doing that, and the reciprocal tariffs have nothing to do with the specific-industry tariffs.\"\n\nThe agreement between the two sides is essentially a 90-day pause that will see reciprocal duties halted though the 10% tariff as well as a 20% charge related to fentanyl remain in place.\n\nBessent expressed encouragement on the fentanyl issue in which Chinese officials \"are now serious about assisting the U.S. in stopping the flow of precursor drugs.\" Bessent did not indicate a specific date when the next round of talks will be held but indicated it should be in the next several weeks.", "publish_ts": 1747008000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/09/germanys-economy-chief-reiche-sets-out-roadmap-to-end-turmoil.html", "title": "Germany’s new economy boss has a plan — and it starts with risk, speed and big bets", "body": "09 May 2025, Bavaria, Gmund Am Tegernsee: Katherina Reiche (CDU), Federal Minister for Economic Affairs and Energy, takes part in the Ludwig Erhard Summit. Representatives from business, politics, science and the media are taking part in the three-day summit. Photo: Sven Hoppe/dpa (Photo by Sven Hoppe/picture alliance via Getty Images) Picture Alliance | Picture Alliance | Getty Images\n\nGermany needs to take more risks and boost its stagnant economy with a decade of investment in infrastructure, German Minister for Economic Affairs and Energy Katherina Reiche said Friday. \"The next decade will be the decade of infrastructure investments in bridges, in energy infrastructure, in storage, in maritime infrastructure... telecommunication. And for this, we need speed. We need speed and investments, and we need private capital,\" Reiche told CNBC's Annette Weisbach on the sidelines of the Tegernsee summit. While 10% of investments could be taken care of with public money, the remaining 90% relied on the private sector, she said. The newly minted economy minister also addressed regulation coming from Brussels, warning that it could hinder companies from investments and start-ups from growing if it is too restrictive. Germany has had to learn that investments comes with risks \"and we have to kind of be open for taking more risks,\" she said.\n\nwatch now\n\nInitiating regulatory changes will in fact be one of the most important jobs for the new German government, Veronika Grimm, member of the German Council of Economic Experts, told CNBC on the sidelines of the Tegernsee summit. \"It will be important to adjust regulation, so removing or changing innovation-stifling regulation so that more is possible again in many areas of technology,\" she said in comments translated by CNBC. \"And then of course it is about improving the environment or businesses, making it more attractive so that we are competitive again,\" Grimm said.\n\nOn the edge of recession\n\nGermany's economy contracted slightly on an annual basis in both 2023 and 2024 and the quarterly gross domestic product has been flipping between growth and contraction for over two years now, just about managing to avoid a technical recession. Preliminary data for the first quarter of 2025 showed a 0.2% expansion. Forecasts do not suggest much of a reprieve from the sluggishness, with the now former German government last month saying it still expects the economy to stagnate this year. \"This country needs an economic turnaround. After two years of recessions the previous government had to announce again [a] zero growth year for 2025 and we really have to work on this. So on the top of the agenda is an investor booster,\" economy minister Reiche said. Lowering energy prices, stabilizing the security of energy supply and reducing bureaucracy were among the key points on the agenda, she added. This is despite a major fiscal U-turn announced earlier this year, which included changes to the country's long-standing debt rules to allow for additional defense spending and a 500-billion-euro ($562.4 billion) infrastructure package. Several of Germany's key industries are under pressure. The auto industry for example is dealing with stark competition from China and now faces tariffs, while issues in housebuilding and infrastructure have been linked to higher costs and bureaucratic hurdles. Trade is also a key pillar for the German economy and therefore uncertainty from U.S. President Donald Trump's changing tariff policies are weighing heavily on the outlook.", "publish_ts": 1746748800000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/08/andrew-bailey-on-why-uk-us-trade-deal-wont-end-uncertainty-.html", "title": "Why the Bank of England governor thinks uncertainty is here to stay despite a trade deal", "body": "Bank of England Governor Andrew Bailey told CNBC on Thursday that the U.K. was heading for more economic uncertainty, despite the country being the first to strike a trade agreement with the U.S. under President Donald Trump's controversial tariff regime.\n\n\"The tariff and trade situation has injected more uncertainty into the situation... There's more uncertainty now than there was in the past,\" Bailey told CNBC in an interview.\n\n\"A U.K.-U.S. trade agreement is very welcome in that sense, very welcome. But the U.K. is a very open economy,\" he continued.\n\nThat means that the impact from tariffs on the U.K. economy comes not just from its own trade relationship with Washington, but also from those of the U.S. and the rest of the world, he said.\n\n\"I hope that what we're seeing on the U.K.-U.S. trade side will be the first of many, and it will be repeated by a whole series of trade agreements, but we have to see that happen of course, and where it actually ends up.\"\n\n\"Because, of course, we are looking at tariff levels that are probably higher than they were beforehand.\"", "publish_ts": 1746662400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/05/china-risks-deeper-deflation-by-diverting-exports-to-domestic-market.html", "title": "China risks a spiral into deeper deflation as it diverts U.S.-bound exports to domestic market", "body": "SHENZHEN, CHINA - APRIL 12: A woman checks her smartphone while walking past a busy intersection in front of a Sam's Club membership store and a McDonald's restaurant on April 12, 2025 in Shenzhen, China.\n\nAs sky-high tariffs kill U.S. orders for Chinese goods, the country has been striving to help exporters divert sales to the domestic market — a move that threatens to drive the world's second-largest economy into deeper deflation.\n\nLocal Chinese governments and major businesses have voiced support to help tariff-hit exporters redirect their products to the domestic market for sale. JD.com , Tencent and Douyin, TikTok's sister app in China, are among the e-commerce giants promoting sales of these goods to Chinese consumers.\n\nSheng Qiuping, vice commerce minister, in a statement last month described China's vast domestic market as a crucial buffer for exporters in weathering external shocks, urging local authorities to coordinate efforts in stabilizing exports and boosting consumption.\n\n\"The side effect is a ferocious price war among Chinese firms,\" said Yingke Zhou, senior China economist at Barclays Bank.\n\nJD.com, for instance, has pledged 200 billion yuan ($28 billion) to help exporters and has set up a dedicated section on its platform for goods originally intended for U.S. buyers, with discounts of up to 55%.\n\nAn influx of discounted goods intended for the U.S. market would also erode companies' profitability, which in turn would weigh on employment, Zhou said. Uncertain job prospects and worries over income stability have already been contributing to weak consumer demand.\n\nAfter hovering just above zero in 2023 and 2024, the consumer price index slipped into negative territory, declining for two straight months in February and March. The producer price index fell for a 29th consecutive month in March, down 2.5% from a year earlier, to clock its steepest decline in four months.\n\nAs the trade war knocks down export orders, deflation in China's wholesale prices will likely deepen to 2.8% in April, from 2.5% in March, according to a team of economists at Morgan Stanley. \"We believe the tariff impact will be the most acute this quarter, as many exporters have halted their production and shipments to the U.S.\"\n\nFor the full year, Shan Hui, chief China economist at Goldman Sachs, expects China's CPI to fall to 0%, from a 0.2% year-on-year growth in 2024, and PPI to decline by 1.6% from a 2.2% drop last year.", "publish_ts": 1746403200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/02/jobs-report-april-2025.html", "title": "U.S. payroll growth totals 177,000 in April, defying expectations", "body": "Nonfarm payrolls increased a seasonally adjusted 177,000 for the month, slightly below the downwardly revised 185,000 in March but above the Dow Jones estimate for 133,000, the Bureau of Labor Statistics reported Friday.\n\nJob growth was stronger than expected in April despite worries over the impact of President Donald Trump 's blanket tariffs against U.S. trading partners.\n\nA broader unemployment gauge that includes discouraged workers and those holding part-time jobs for economic reasons, or the underemployed, edged lower to 7.8%. The labor force participation rate ticked higher to 62.6%.\n\nThe unemployment rate held at 4.2%, as expected, indicating that the labor market is holding relatively stable. The survey of households, which is used to calculate the jobless rate, showed an even stronger gain, with an increase of 436,000 in those who reported holding jobs on the month.\n\nStock market futures rose following the release as did Treasury yields.\n\n\"We can push recession concerns to another month. Job numbers remain very strong, suggesting there was an impressive degree of resilience in the economy in play before the tariff shock,\" said Seema Shah, chief global strategist at Principal Asset Management. \"The economy will weaken in the coming months but, with this underlying momentum, the U.S. has a decent chance of averting recession if it can step back from the tariff brink in time.\"\n\nThe report comes amid an uncertain climate in which Trump kicked off April by slapping \"liberation day\" 10% across-the-board tariffs on U.S. imports, and threatened a menu of other \"reciprocal\" duties on dozens of other nations.\n\nHowever, Trump later decided to put a 90-day hold on the reciprocal tariffs pending ongoing negotiations. In recent days, White House officials have indicated that deals with some of the impacted nations are forthcoming, though there have been no official announcements.\n\nThe strong report led traders to push out expectations for an interest rate cut until July, according to the CME Group's FedWatch gauge of futures pricing.\n\nHealth care continued to be a leader in job creation, adding 51,000 jobs. Other sectors posting gains included transportation and warehousing (29,000), financial activities (14,000), and social assistance.\n\nThe federal government reported a loss of 9,000 jobs on the month amid Trump's efforts, led by Elon Musk and the Department of Government Efficiency, to trim payrolls in the public sector. Federal government jobs have declined by just 26,000 since January, as employees furloughed but still receiving severance are not counted as unemployed, according to the BLS.\n\nManufacturing saw a slight loss of 1,000 jobs as well.\n\n\"This first jobs report post-Liberation Day is much too soon for the impacts of tariffs to show up,\" said Daniel Zhao, lead economist at job review site Glassdoor. \"Even May may still be too early as businesses work down inventories. But today's report does set the benchmark against which we'll measure the tariff impacts.\"\n\nOn the wage side, average hourly earnings rose just 0.2% for the month, below the 0.3% forecast, while the annual rate of 3.8% also was 0.1 percentage point less than expected and the lowest since July 2024.", "publish_ts": 1746144000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/02/euro-zone-inflation-april-2025.html", "title": "Euro zone inflation unchanged at 2.2% in April, leaving path open for further ECB interest rate cuts", "body": "Shoppers buy fresh vegetables, fruit, and herbs at an outdoor produce market under green-striped canopies in Regensburg, Upper Palatinate, Bavaria, Germany, on April 19, 2025.\n\nEuro zone inflation was unchanged at 2.2% in April, missing expectations for a move lower, flash data from statistics agency Eurostat showed Friday.\n\nEconomists polled by Reuters had been expecting the reading to come in at 2.1% in April compared to March's 2.2% as inflation has been easing back towards the European Central Bank's 2% target.\n\nCore inflation, which excludes more volatile food, energy, alcohol and tobacco prices, accelerated to 2.7% from March's 2.4%. The closely-watched services inflation print also picked up again, coming in at 3.9% compared to the previous 3.5% reading.\n\nThe euro was higher against the U.S. dollar and the British pound following the data release. Bond yields were little changed, with the yield on 10-year German bonds continuing to trade around 3 basis points higher.\n\nThe increase in services inflation was likely \"driven mainly by Easter timing effects,\" Franziska Palmas, senior Europe economist at Capital Economics, said in a note. These effects would reverse in the coming month, she added, suggesting that this left the door open for further interest rate cuts from the European Central Bank.\n\n\"We think the services rate will decline significantly in the rest of this year as US tariffs weigh on activity and the labour market continues to weaken,\" Palmas added.\n\nMichael Field, chief equity strategist at Morningstar, meanwhile urged caution, saying tariff uncertainty meant \"any level of comfort we have here is precarious.\" A further escalation of tariff tensions would mean a pick-up of inflation in Europe, he said.\n\nField added that further ECB rate cuts were still on the table. \"This relatively low level of headline inflation keeps the pressure off the ECB, who can in turn lower interest rates further,\" he said.\n\nECB President Christine Lagarde told CNBC last week that \"we're heading towards our [inflation] target in the course of 2025, so that disinflationary process is so much on track that we are nearing completion.\"\n\nLagarde and other policymakers last week warned the picture for inflation was less clear in the medium-term, with factors such as potential retaliation countermeasures from Europe against U.S. tariffs and fiscal shifts like Germany's major infrastructure package coming into play.\n\nLagarde said the ECB would be \"data dependent to the extreme,\" when making interest rate decisions. The central bank last cut interest rates last month, taking its key rate — the deposit facility rate — to 2.25%, down from highs of 4% in mid-2023.", "publish_ts": 1746144000000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/01/jobs-report-friday-to-provide-important-clues-on-where-the-economy-is-heading-.html", "title": "Jobs report Friday to provide important clues on where the economy is heading", "body": "Steven Chechette (C) speaks with a recruiter at the KeySource booth at the Mega JobNewsUSA South Florida Job Fair held in the Amerant Bank Arena on April 30, 2025, in Sunrise, Florida.\n\nClues on whether the U.S. economy is merely in a temporary tariff-induced funk or a more damaging longer-turn downtrend should come Friday when the Labor Department releases the April jobs report.\n\nEconomists expect nonfarm payrolls to post an increase of 133,000, which would be a steep slide from the 228,000 in March, according to the Dow Jones consensus. However, it would be only slightly below the 152,000 average for the first three months of the year and likely would be enough to hold the unemployment rate around 4.2%.\n\nBut a downside surprise could be perilous considering the recent spate of bad economic news and the prevailing angst over the way President Donald Trump is implementing tariffs against U.S. trading partners.\n\n\"If it's around 150,000 give or take, I think all will be forgiven,\" said Mark Zandi, chief economist at Moody's Analytics. \"So I think we'll end the week feeling OK, not great, but OK. Things aren't falling apart.\"\n\nHowever, Zandi and other economists say financial markets may want to brace for disappointment. Specifically, he has his eye on anything less than 100,000 for payrolls growth, which he expects would cause the dour economic feelings to take over.\n\n\"If the number's 100,000 or anything south of that, then I think I'd watch out,\" he said. \"Then all the other data will take on greater importance, and people will be marking down their expectations. That could be a tough day in the markets.\"", "publish_ts": 1746057600000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/30/gdp-q1-2025-.html", "title": "U.S. economy shrank 0.3% in the first quarter as Trump policy uncertainty weighed on businesses", "body": "watch now\n\nThe U.S. economy contracted in the first three months of 2025 on an import surge at the start of President Donald Trump's second term in office as he wages a potentially costly trade war. Gross domestic product, a sum of all the goods and services produced from January through March, fell at a 0.3% annualized pace, according to a Commerce Department report Wednesday adjusted for seasonal factors and inflation. This was the first quarter of negative growth since Q1 of 2022. Economists surveyed by Dow Jones had been looking for a gain of 0.4% after GDP rose by 2.4% in the fourth quarter of 2024. However, over the past day or so some Wall Street economists changed their outlook to negative growth, largely because of an unexpected rise in imports as companies and consumers sought to get ahead of the Trump tariffs implemented in early April. Indeed, imports soared 41.3% for the quarter, driven by a 50.9% increase in goods, for the biggest growth outside the Covid pandemic since 1974. Imports subtract from GDP, so the contraction in growth may not be viewed as negatively given the potential for the trend to reverse in subsequent quarters. Imports took more than 5 percentage points off the headline reading. Exports rose 1.8%. A slowdown in consumer spending and a sharp decline in federal outlays also contributed to the weak GDP number amid Elon Musk's efforts at the Department of Government Efficiency. \"Maybe some of this negativity is due to a rush to bring in imports before the tariffs go up, but there is simply no way for policy advisors to sugar-coat this. Growth has simply vanished,\" said Chris Rupkey, chief economist at Fwdbonds.\n\nPeople shop in a Manhattan store on July 27, 2023 in New York City. Spencer Platt | Getty Images News | Getty Images\n\nConsumer spending slowed during the period but was still positive. Personal consumption expenditures increased 1.8% for the period, the slowest quarterly gain since Q2 of 2023 and down from a 4% gain in the prior quarter. However, a separate report showed that spending was up 0.7% in March, higher than the 0.5% estimate. Moreover, private domestic investment soared during the period, rising 21.9%, primarily driven by a 22.5% surge in equipment spending that also could have been tariff driven. Federal government expenditures declined 5.1% for the quarter, shaving about one-third of a percentage point off GDP. The report comes ahead of the next uncertain steps for Trump's trade policy. In early April, the president announced 10% across-the-board tariffs on U.S. trade partners as well as a menu of select \"reciprocal\" duties against dozens of nations. On April 9, Trump suspended those duties for a 90-day negotiation period that has yet to yield results, though administration officials have indicated that some deals are near. \"No surprise that GDP took a hit in the first quarter, mainly because the balance of trade blew up as companies imported goods like crazy to front-run tariffs. The more telling number for the future of the expansion was consumer spending, and it grew, but at a relatively weak pace,\" said Robert Frick, corporate economist with Navy Federal Credit Union. \"That's concerning, but not alarming as it could have been due to bad weather and a spending surge at the end of last year.\" Stock market futures slipped following the report while Treasury yields moved higher. In a Truth Social post following the report, Trump did not address GDP specifically, instead referring to \"Biden's Stock Market, not Trump's.\" \"Tariffs will soon start kicking in, and companies are starting to move into the USA in record numbers,\" Trump wrote. \"Our Country will boom, but we have to get rid of the Biden 'Overhang.' This will take a while, has NOTHING TO DO WITH TARIFFS, only that he left us with bad numbers, but when the boom begins, it will be like no other. BE PATIENT!!!\"\n\nInflation higher", "publish_ts": 1745971200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/30/adp-jobs-report-april-2025.html", "title": "Private payroll growth slowed to 62,000 in April, well below expectations", "body": "Companies slowed hiring sharply in April as they braced against potential impacts from President Donald Trump's tariffs against U.S. trading partners, ADP reported Wednesday.\n\nPrivate sector payrolls rose by just 62,000 for the month, the smallest gain since July 2024, amid heightened uncertainty over the degree of the tariffs and the impact they would have on hiring plans and broader economic conditions.\n\nThe total marked a deceleration from the downwardly revised gain of 147,000 in March and missed the Dow Jones consensus estimate for an increase of 120,000.\n\n\"Unease is the word of the day. Employers are trying to reconcile policy and consumer uncertainty with a run of mostly positive economic data,\" said ADP's chief economist, Nela Richardson. \"It can be difficult to make hiring decisions in such an environment.\"\n\nWage gains also took a step backward, rising 4.5% from a year ago for those staying in their jobs, down 0.1 percentage point from March. However, job changers saw an increase to 6.9%, up 0.2 percentage point.\n\nFrom a sector standpoint, leisure and hospitality posted the biggest gain, adding 27,000 jobs. Others that showed increases included trade, transportation and utilities (21,000), financial activities (20,000), and construction (16,000). Education and health services lost 23,000 positions while information services fell by 8,000.\n\nThe ADP estimate serves as a precursor to Friday's nonfarm payrolls data from the Bureau of Labor Statistics, and the two reports can differ substantially. Economists surveyed by Dow Jones are looking for job growth of 133,000 in the BLS report, which unlike ADP includes government hiring. The unemployment rate is expected to be unchanged at 4.2%.", "publish_ts": 1745971200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/30/euro-zone-gdp-q1-2025.html", "title": "Euro zone economy expands by better-than-expected 0.4% in the first quarter", "body": "Freight containers are stacked in the east of the banking city on the site of the DB transshipment station. The skyscrapers of the banking skyline rise up behind them. US President Trump's aggressive US customs policy can also be seen as a trade war against the rest of the world.\n\nThe euro zone economy grew by a stronger-than-expected 0.4% in the first quarter, flash data from statistics agency Eurostat showed Wednesday, as global tariff tensions cast uncertainty upon the bloc's trajectory.\n\nEconomists polled by Reuters had forecast a 0.2% expansion in the first three months of the year, following a revised 0.2% growth print in the last quarter of 2024.\n\nFigures published earlier Wednesday showed the gross domestic product (GDP) of Germany, Europe's largest economy, rose 0.2% over the same period. French GDP added 0.1% across the three-month stretch.\n\nContinuing a recent trend, southern European and smaller economies outperformed, with the Spanish and Lithuanian GDPs adding 0.6% each, while Italy's economic output grew by 0.3%. The economy of Ireland, which tends to have volatile readings due to its high proportion of multinational companies, expanded by 3.2% in the first quarter.\n\nFranziska Palmas, senior Europe economist at Capital Economics, said the latest euro zone GDP reading showed the area's economy started 2025 on a stronger footing than activity surveys had suggested.\n\n\"Nevertheless, we still expect growth to slow sharply in the next six months as the US tariffs introduced in April will hit activity,\" Palmas said, adding that any boost coming from the huge fiscal stimulus expected in Germany would mostly be felt next year.\n\nThe euro was choppy Wednesday, trading 0.08% lower against the U.S. dollar at 10:35 a.m. in London following the print, and 0.2% higher against the British pound. Germany's 10-year bond yield, seen as the benchmark for the euro area, was three basis points lower.", "publish_ts": 1745971200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/30/german-gdp-first-quarter-2025.html", "title": "German inflation dips less than expected to 2.2% in April", "body": "Two German flags fly in front of and on top of the Reichstag building at sunset. Photo by Hannes P Albert/picture alliance via Getty Images\n\nGerman consumer inflation came in at 2.2% in April on an annual basis, easing slightly from March levels but coming in above expectations, preliminary data showed Wednesday. Economists polled by Reuters had estimated a 2.1% reading. The country's consumer price index, harmonized for comparability across the euro zone, had come in at 2.3% in March on an annual basis. So-called core inflation, which excludes food and energy prices, accelerated to 2.9% in April from 2.6% in March. The closely-watched services print also jumped to 3.9%, after a 3.5% reading in the previous month. Energy prices meanwhile dropped sharply, falling by 5.4% according to the statistics office. While the inflation rate closing in on the European Central Bank's 2% mark is good news for consumers at first glance, there are some less positive points about the data on closer look, Sebastian Becker, economist at Deutsche Bank, said in a note Wednesday. The slight decrease of the headline figures only took place due to lower energy and food costs, he said. \"In comparison, the core inflation rate, which is more important for the ECB ... rose notably again.\" And services inflation appears \"considerably more stubborn than expected,\" Becker added.\n\nEconomic growth\n\nEarlier on Wednesday, preliminary data showed that Germany's economy expanded by 0.2% in the first quarter from the previous three-month period. The figure, released by the German federal statistics office, is adjusted for price, calendar and seasonal variations. The gross domestic product reading was in line with estimates from economists polled by Reuters. Germany's gross domestic had contracted by 0.2% in the fourth quarter. The statistics office attributed the quarterly increase to the fact \"that both household final consumption expenditure and capital formation were higher than in the previous quarter.\" While acknowledging Wednesday's figures were positive, \"the quarterly increase is still far too small to end the country's long-lasting stagnation,\" Carsten Brzeski, global head of macro at ING, said in a note. Europe's largest economy has long been sluggish, with its GDP flip-flopping between growth and contraction in each quarter throughout 2023 and 2024. The country has so far avoided technical recession, which is defined by two consecutive quarters of contraction. Key sectors of the economy, such as autos, have been suffering from stronger competition from China. Other industries including housebuilding and infrastructure have also been going through trying times that have been linked to higher costs, muted investment and bureaucratic hurdles. Separately, U.S President Donald Trump's tariff policies have thrust uncertainty onto export reliant Germany which counts the U.S. as its most important trading partner. As part of the European Union, Germany is facing 20% blanket tariffs on goods exported to the U.S., although these levies have been temporarily reduced to 10% to allow time for negotiations. U.S. duties on steel, aluminum and autos also affect the country. The German government last week cut its economic outlook to predict stagnation in 2025, with outgoing economy minister Robert Habeck saying Trump's trade policies and their impact on the country were the main factor behind the revision.\n\nFiscal upheaval", "publish_ts": 1745971200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/29/consumer-outlook-hits-lowest-since-2011-as-tariff-fears-mount-conference-board-survey-shows.html", "title": "Consumer outlook hits lowest since 2011 as tariff fears mount, Conference Board survey shows", "body": "Consumer attitudes about both the present and near future dimmed again in April, as tariffs dented sentiment and confidence in employment hit levels last seen around the global financial crisis.\n\nThe Conference Board's Consumer Confidence Index fell to 86 on the month, down 7.9 points from its prior reading and below the Dow Jones estimate for 87.7. It was the lowest reading in nearly five years.\n\nHowever, the view of conditions further out deteriorated even more.\n\nThe board's expectations index, which measures how respondents look at the next six months, tumbled to 54.4, a decline of 12.5 points and the lowest reading since October 2011. Board officials said the reading is consistent with a recession.\n\n\"The three expectation components—business conditions, employment prospects, and future income—all deteriorated sharply, reflecting pervasive pessimism about the future,\" said Stephanie Guichard, the board's senior economist for global indicator.\n\nGuichard added that the confidence surveys overall were at \"levels not seen since the onset of the Covid pandemic.\"\n\nIndeed, the level of respondents expecting employment to fall over the next six months hit 32.1%, \"nearly as high as in April 2009, in the middle of the Great Recession,\" Guichard added. That contraction lasted from December 2007 until June 2009. The level of respondents seeing jobs as \"hard to get\" rose to 16.6%, up half a percentage point from March, while those seeing jobs as \"plentiful\" fell to 31.7%, down from 33.6%.\n\nFuture income prospects also turned negative for the first time in five years.\n\nThe downbeat views extended to the stock market, with 48.5% expecting lower prices in the next 12 months, the worst reading since October 2011. Inflation expectations also surged, at 7% for the next year, the highest since November 2022.\n\nDriving the pessimism was fear over tariffs, which reached an all-time high for the survey. Recession expectations hit a two-year high as well.\n\nIn related data Tuesday, the Bureau of Labor Statistics reported that employment postings in March fell to their lowest level since September 2024. The Job Openings and Labor Turnover Survey showed 7.19 million positions, down from 7.48 million in February and below the Wall Street expectation of 7.5 million.\n\nGovernment postings fell by 59,000 amid President Donald Trump's efforts to pare down the federal workforce. Transportation, warehousing and utilities also saw a drop of 59,000.\n\nThe JOLTS survey showed hiring was little changed while layoffs fell by 222,000.", "publish_ts": 1745884800000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/29/port-of-los-angeles-sees-shipping-volume-down-35percent-next-week-as-tariffs-bite.html", "title": "Port of Los Angeles says shipping volume will plummet 35% next week as China tariffs start to bite", "body": "\"According to our own port optimizer, which measures the loadings in Asia, we'll be down just a little bit over 35% next week compared to last year. And it's a precipitous drop in volume with a number of major American retailers stopping all shipments from China based on the tariffs,\" Seroka said.\n\nGene Seroka, executive director of the Port of Los Angeles, said Tuesday on CNBC's \"Squawk Box \" that he expects incoming cargo volume to slide by more than a third next week compared with the same period in 2024.\n\nShipments from China to the West Coast of the U.S. will plummet next week as the impact of President Donald Trump 's tariffs leads companies to cut their import orders.\n\nShipments from China make up about 45% of the business for the Port of LA, though some transport companies will be looking to pick up goods at other points in Southeast Asia to try to fill up their ships, Seroka said.\n\n\"Realistically speaking, until some accord or framework can be reached with China, the volume coming out of there — save a couple of different commodities — will be very light at best,\" Seroka said.\n\nAlong with the lower volume of goods, Seroka said he expects roughly a quarter of the usual number of arriving ships to the port to be canceled in May.\n\nTrump announced a sharp increase in tariffs on Chinese goods on April 2, which led to escalation on both sides, eventually resulting in both the U.S. and China imposing levies of more than 100% on many goods from each other. U.S. Treasury Secretary Scott Bessent has described the situation as \"unsustainable\" but there has been no sign of substantial negotiations between the two countries.\n\nData on shipments out of China had already started to signal slowing trade volume to the U.S., alarming some economists. Apollo Global Management's chief economist, Torsten Slok, recently laid out a timeline where lower imports from China leads to layoffs in transportation and retail industries in the U.S., empty shelves and a recession this summer.\n\nSeroka said he thinks U.S. retailers have about five to seven weeks before the impact of the curtailed shipments begins to bite, partly because companies stocked up ahead of Trump's tariff announcements.\n\n\"I don't see a complete emptiness on store shelves or online when we're buying. But if you're out looking for a blue shirt, you might find 11 purple ones and one blue in a size that's not yours. So we'll start seeing less choice on those shelves simply because we're not getting the variety of goods coming in here based on the additional costs in place. And for that one blue shirt that's still left, you'll see a price hike,\" Seroka said.", "publish_ts": 1745884800000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/29/adidas-warns-it-will-raise-prices-on-all-us-products-due-to-tariffs.html", "title": "Adidas warns tariffs will lead to higher costs on its U.S. products", "body": "Sportswear giant Adidas on Tuesday said that U.S. President Donald Trump's tariffs would result in cost hikes for all its U.S. products.\n\nThe company said it did not yet know by how much it would boost prices, also noting that the global trade dispute was preventing it from raising its full-year outlook despite a bumper increase in first-quarter profits.\n\n\"Higher tariffs will eventually cause higher costs for all our products for the US market,\" Adidas said in a statement.\n\nThe company said it was \"somewhat exposed\" to White House tariffs on Beijing — currently at an effective rate of 145% — but that it had already reduced exports of its China-made products to the U.S. to a minimum. However, it said the biggest impact was coming from the general increase in U.S. tariffs on all other countries, which are largely held at 10% while trade negotiations take place.\n\n\"Given the uncertainty around the negotiations between the US and the different exporting countries, we do not know what the final tariffs will be,\" the Adidas statement continued.\n\n\"Therefore, we cannot make any 'final' decisions on what to do. Cost increases due to higher tariffs will eventually cause price increases, not only in our sector, but it is currently impossible to quantify these or to conclude what impact this could have on the consumer demand for our products.\"\n\nAdidas said it was currently unable to produce almost any of its products in the U.S.\n\nThe company, best-known for sneakers including Superstar, Sambas, Stan Smiths and Gazelles as well as sportswear, uses factories in countries including Vietnam and Cambodia — which are facing U.S. tariffs upwards of 40% in the absence of a trade deal.\n\nA similar dilemma regarding price hikes and demand impact is facing almost all retail businesses which serve the U.S., from ultra-low-cost e-retailers like Temu to luxury giants such as Hermès.", "publish_ts": 1745884800000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/28/empty-shelves-trucking-layoffs-lead-to-recession-in-apollos-trade-war-timeline.html", "title": "Empty shelves, trucking layoffs lead to a summer recession in Apollo's shocking trade fight timeline", "body": "\"The consequence will be empty shelves in US stores in a few weeks and Covid-like shortages for consumers and for firms using Chinese products as intermediate goods,\" Slok wrote in a note to clients Friday.\n\nTorsten Slok, chief economist at Apollo, laid out a timeline in a presentation for clients that showed when the impact of tariffs announced by President Donald Trump could hit the U.S. economy. Based on the transport time required for goods from China, U.S. consumers could start to notice trade-related shortages in their local stores next month, according to the presentation.\n\nThe economic impact of the tariffs imposed by the Trump administration will soon become apparent to everyday Americans and lead to a recession this summer, according to Apollo Global Management.\n\nApril 2: Tariffs announced, containership departures from China to U.S. slowing\n\nEarly-to-mid May: Containerships to U.S. ports come to a stop\n\nMid-to-late May: Trucking demand comes to a halt, leading to empty shelves and lower sales for companies\n\nLate May to early June: Layoffs in trucking and retail industries\n\nSummer 2025: recession\n\nSource: Apollo Global Management\n\nTo support the idea that the U.S. economy is on the verge of recession, the presentation also included data that shows new orders for business, earnings outlooks and capital spending plans have all fallen sharply in recent weeks.\n\nThe Trump administration has paused some of the tariffs announced on April 2, but has hiked duties even higher on China. Treasury Secretary Scott Bessent acknowledged Monday on CNBC's \"Squawk Box\" that the current tariff standoff with Beijing is \"unsustainable.\" Levies on goods from China are now subject to a 145% rate.\n\nChina is not the only source of consumer goods, but it does have a large role in the U.S. economy. The U.S. imported $438.9 billion of goods from China in 2024, according to the Office of the United States Trade Representative, putting it right behind Mexico and above Canada on the list of trading partners by that metric.\n\nWhile many on Wall Street are now saying that a recession for the U.S. is likely in 2025, Slok's predictions are toward the more pessimistic side. Bessent has said the administration expects a \"detox period\" for the economy due to the trade negotiations but not necessarily a recession.\n\nThere is also some evidence of a \"pull-forward\" in orders from before the tariffs were announced, which could keep goods on the shelves for longer than the Apollo timelines sets out.\n\n\"Don't expect empty shelves yet — [year to date] stock is still up, and demand is slowing,\" Bernstein analyst Aneesha Sherman said in a note to clients Monday.\n\n— CNBC's Michael Bloom contributed reporting.", "publish_ts": 1745798400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/28/german-fiscal-boost-wont-outweigh-tariff-drag-for-euro-zone-imf.html", "title": "German fiscal boost won't outweigh tariff drag for euro zone, IMF's Europe head says", "body": "Higher German infrastructure spending will boost Europe's economic growth in the coming years — but not enough to outweigh the expected drag from U.S. tariffs, according to Alfred Kammer, director of the European department at the International Monetary Fund.\n\nThe IMF last week cut its growth outlook for the euro area, also making downgrades for the U.S., U.K. and many Asian countries due to President Donald Trump's volatile tariff policy.\n\nThe institution cut its euro area growth forecasts for each of the next two years by 0.2 percentage points, to 0.8% in 2025 and 1.2% in 2026.\n\n\"It's the tariffs and the trade tensions which weigh on the outlook rather than the positive effects on the fiscal side,\" Kammer told CNBC's Carolin Roth in an interview at the IMF-World Bank Spring Meetings last week.\n\n\"What we see is we have a meaningful downgrade for Europe advanced economies... and for the emerging euro area countries double as much over this two-year period.\"\n\nThe negative impact of tariffs will be slightly offset by Germany's recent infrastructure spending bill, which will boost growth in the euro area over those two years, Kammer said.\n\nExemptions passed to Germany's longstanding debt rules have unlocked higher defense spending and enabled creation of a 500 billion euro ($548 billion) infrastructure and climate fund. The move has been described by economists as a potential \"game changer\" for the sluggish economy — the largest in the euro zone.", "publish_ts": 1745798400000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/26/americans-are-getting-flashbacks-to-2008-as-tariffs-stoke-recession-fears.html", "title": "Americans are getting flashbacks to 2008 as tariffs stoke recession fears", "body": "Homemade barbecue pork chops. Katy Perry performs onstage during the Katy Perry The Lifetimes Tour 2025. A woman checks her receipt while exiting a store. iStock| Theo Wargo | Hispanolistic | Getty Images\n\nA few weeks ago, as Kiki Rough felt increasingly concerned about the state of the economy, she began thinking about previous periods of financial hardship. Rough thought about the skills she learned for making groceries stretch during the tough times that accompanied past economic downturns. Facing similar feelings of uncertainty about the country's financial future, she began making video guides to recipes from cookbooks published during previous recessions, depressions and wartimes. The 28-year-old told followers that she is not a professional chef, but instead earned her stripes by learning to cook while on food stamps. From Rough's yellow-and-black kitchen in the Chicago suburbs, she teaches viewers how to make cheap meals and at-home replacements for items like breakfast strudel or donuts. She often reminds people to replace ingredients with alternatives they already have in the pantry. \"I keep seeing this joke over and over in the comments: The old poors teaching the new poors,\" Rough told CNBC. \"We just need to share knowledge right now because everyone is scared, and learning is going to give people the security to navigate these situations.\" The self-employed consultant's videos quickly found an audience on TikTok and Instagram . Between both platforms, she's gained 350,000 followers and garnered about 21 million views on videos over the last month, by her count. President Donald Trump's announcement of broad and steep tariffs earlier in April has ratcheted up fears of the U.S. economy tipping into a recession in recent weeks. As Americans like Rough grow increasingly worried about the road ahead, they are harking back to the tips and tricks they employed to scrape by during dark financial chapters like the global financial crisis that exploded in 2008. Google is predicting a spike in search volumes this month for terms related to the recession that came to define the late 2000s. Searches for the \"Global Financial Crisis\" are expected to hit levels not seen since 2010, while inquiries for the \"Great Recession\" are slated to be at their highest rate since the onset of the Covid pandemic.\n\nPorkchops, house parties and jungle juice\n\nOn TikTok, a gaggle of Millennials and Gen Xers has stepped into the roles of older siblings, offering flashbacks and advice to younger people on how to pinch pennies. Some Gen Zers have put out calls to elders for insights on what a recession may feel like at this stage of life, having been too young to feel the full effects of the financial crisis. \"This is, potentially, at least on a large scale, the first time that millennials have been able to be the 'experts' on something,\" said Scott Sills, a 33-year-old marketer in Louisiana. \"We're the experts on getting the rug pulled out from under us.\" Those doling out the advice are taking a trip down memory lane the to tail-end of the aughts. Cheap getaways to Florida were the norm instead of lush trips abroad. They had folders for receipts in case big-ticket purchases went on sale later. Business casual outfits were commonplace at social events because they couldn't afford multiple styles of clothing. Porkchops were a staple dinner given their relative affordability, leading one creator to declare that they \"taste like\" the Great Recession. They drank \"jungle juice\" at house parties, a concoction of various cheap liquors and mixers, instead of cocktails at bars. \"There's things that I didn't realize were 'recession indicators' the first time around that I thought were just the trends,\" said M.A. Lakewood, a writer and professional fundraiser in upstate New York. \"Now, you can see it coming from 10 miles away.\"\n\nCustomers shop for produce at an H-E-B grocery store on Feb. 12, 2025 in Austin, Texas. Brandon Bell | Getty Images\n\nTo be sure, some of the discourse has centered around how inflationary pressures have made a handful of these hacks defunct. Some content creators pointed out that the federal minimum wage has sat at $7.25 per hour since 2009 despite the cost of living skyrocketing. Kimberly Casamento recently began a TikTok series walking viewers through recipes from a cookbook that was focused on affordable meals published in 2009. The New Jersey-based digital media manager said she's found costs for what were then considered low-budget meals ballooning between about 100% and 150%. In addition to sharing the price changes, the 33-year-old gives viewers some tips on how to keep costs down. \"Every aspect of life is so expensive that it's hard for anybody to survive,\" Casamento said. \"If you can cut the cost of your meal by $5, then that's a win.\"\n\n'A very human thing'\n\nThis type of communal knowledge-sharing is common during times of economic belt tightening, according to Megan Way, an associate professor at Babson College who studies family and intergenerational economics. While conversations about how to slash costs or to make meals stretch typically took place among neighbors in the late 2000s, Way said it makes sense that they would now play out in the digital square with the rise of social media. \"It's a very human thing to reach out to others when things are feeling uncertain and try to gain on their experience,\" Way said. \"It can really make a difference for feeling like you're moving forward a little prepared. One of the worst things for an economy is absolute fear.\"\n\nWay said that Americans are quick to look back to the Great Recession for a guide because that downturn was so shocking and widely felt. However, she said there's key differences between that economic situation and what the U.S. is facing today, such as the absence of bad debt that sparked the housing market's crash. Still, she said there's broad uncertainty felt today on several fronts — be it tied to the economy, geopolitics or domestic policy priorities like slashing the federal workforce or limiting immigration. That can reignite the feeling of unpredictability about what the future will bring that was paramount during the Great Recession, Way said. In 2025, it's clear that economic confidence among the average American is rapidly souring. The University of Michigan's index of consumer sentiment recorded one of its worst readings in more than seven decades this month.\n\nWith that negative economic outlook comes rising stress. When Lukas Battle made a satirical TikTok about feeling like divorces were increasingly common around the time of the Great Recession, the 27-year-old's comments were abuzz with people talking about their parents splitting recently. (Though divorce has been seen as a cultural hallmark of the financial crisis, data shows the rate actually declined during this period.) \"There's a second round of divorces happening as we speak,\" Battle said.\n\nCultural parallels\n\nThat's one of several parallels social media users have drawn between the late aughts and today. When videos surfaced of a group dancing to Doechii's hit song \"Anxiety,\" several commenters on X reported feeling déjà vu to when flashmob performances were common. Disney 's reboot of the animated show \"Phineas and Ferb,\" which originally premiered in the late 2000s, similarly put the era top of mind.\n\nLady Gaga performing at Coachella 2017 Getty Images | Christopher Polk", "publish_ts": 1745625600000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/25/ecb-members-say-inflation-job-nearly-done-but-tariff-risks-loom.html", "title": "Inflation job nearly done but tariff risks loom — What European Central Bank members said this week", "body": "Guests and attendeess mingle and walk through the atrium during the IMF/World Bank Group Spring Meetings at the IMF headquarters in Washington, DC, on April 24, 2025. Jim Watson | Afp | Getty Images\n\nChristine Lagarde, European Central Bank president\n\nOn inflation and monetary policy: \"We're heading towards our [inflation] target in the course of 2025, so that disinflationary process is so much on track that we are nearing completion. But we have the shocks, you know, and the shocks will be a dampen on GDP. It's a negative shock to demand.\" \"The net impact on inflation will depend on what countermeasures are eventually taken by Europe. Then we have to take into account the [German] fiscal push by the defense investments, by the infrastructure fund.\" \"We have seen successive movements, you know, announcement [of U.S. tariffs], and then a pause, and then some exemptions. So we have to be very attentive... Either we cut, either we pause, but we will be data dependent to the extreme.\"\n\nwatch now\n\nOn market moves: \"When we had done our projections, we anticipated that... the dollar would appreciate, the euro would depreciate. It's not what we saw. And there have been some counter-intuitive movements in various categories.\" \"The German market has obviously been shocked in a positive way by the program soon to be put in place by the German government, with a commitment to defense, with a commitment to a big fund for infrastructure development.\"\n\nKlaas Knot, The Netherlands Bank president\n\nOn tariff uncertainty: \"If I look back over the last 14 years, in the initial days of the pandemic I think that was comparable uncertainty to what we have now.\" \"In the short run, it's crystal clear that the uncertainty that is created by the unpredictability of the tariff actions by the U.S. government works as a strong negative factor for growth. Basically, uncertainty is like a tax without revenue.\" On the inflation impact: \"In the short run, we will have lower growth. We will probably also have lower inflation. As we also see, the euro is appreciating as energy prices have also come down. So together with the sort of negative factor uncertainty in the short run, it's crystal clear that it will accelerate the disinflation.\"\n\nwatch now\n\n\"But in the medium term, the inflation outlook is not all that clear. I think there are still these negative factors. But in the medium term, you might get retaliation. You might get the disruption of global value chains, which might also be inflationary in other parts of the world than the U.S. only. And then, of course, we have the fiscal policy coming in in Europe. So this is actually a time in which you need projections.\" On a June rate cut and market pricing for two more ECB rate cuts in 2025: \"I'm fully open minded. I think it's way too early to already take a position on June, whether it would be another cut. It will fully depend on these projections.\" \"I would need to see a more structured analysis of the impact on the inflation profile ahead of us, and only then can I say whether the market is pricing fair or whether I don't.\"\n\nRobert Holzmann, Austrian National Bank governor\n\nOn the need to wait for more data and news on tariffs: \"We have not seen this uncertainty now for years... unless the uncertainty subsides, by the right decisions, we will have to hold back a number of our decisions, and hence, we don't know yet in what direction monetary policy should be best moved.\" \"Before looking at data in detail, the question is, what kind of political decisions will be taken? Is it that we will have some tariff increases? Is it that we will have strong tariff increases? Is it that we will have retribution by high counter tariffs?\"\n\nwatch now\n\nOn the ECB's April rate cut: \"I think there's a broad consensus [on rates]. But of course, at the margin, people differ.\" \"My assessment is that at this time, it wasn't clear yet to what extent [tariff] countermeasures were being taken. Because with countermeasures in Europe, prices may have increased. Without countermeasures, quite likely the price pressure is downward. And for the time being, we don't know yet the direction.\" On the direction of interest rates: \"I think if the recent noises about an arrangement [on trade] were to be true, in this case, quite likely it is more towards the downside than the upside with regard to prices. But this can be changed with different decisions and the result of which, we may even imagine in [the] other direction. For the time being, no, it will be down.\" \"There may be further cuts this year, but the number is still outstanding.\"\n\nMārtiņš Kazāks, Bank of Latvia governor\n\nOn opportunity from tariffs: \"With all this uncertainty and vulnerability, this is also the time of opportunities for Europe.\" \"It's a time for Europe to grasp all the aspects of being an economic superpower and becoming a really fully-fledged political and geopolitical superpower, and this requires doing all the decisions that in the past, were not carried out fully.\" \"This requires political will, political guts to make those decisions, and to strengthen the European economy and assert its place in a global world.\"\n\nwatch now", "publish_ts": 1745539200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/04/25/trump-insists-bond-market-tumult-didnt-influence-tariff-pause-i-wasnt-worried.html", "title": "Trump insists bond market tumult didn't influence tariff pause: 'I wasn't worried'", "body": "US President Donald Trump speaks during a bilateral meeting with Prime Minister of Norway Jonas Gahr Store in the Oval Office of the White House in Washington, DC, on April 24, 2025.\n\nUltimately, Trump issued a 90-day stay on the reciprocal tariffs to allow time for negotiation. But he said it wasn't because of the market tumult.\n\nMarkets recoiled following the release. Treasury yields initially headed lower but quickly snapped higher. The 10-year yield rose half a percentage point in just a few days, one of its quickest moves ever, as investors also ditched stocks and the U.S. dollar.\n\nIn the decree, Trump slapped 10% across-the-board duties against all U.S. imports and released a list of tariffs against dozens of other nations. The extra levies were based on trade deficits the U.S. had against the respective countries and raised fears about inflation, a potential recession and disruption of long-held trade agreements.\n\n\"I wasn't worried,\" Trump said in a Time magazine interview during which he was asked about financial market tumult after his April 2 \"Liberation Day\" announcement.\n\nPresident Donald Trump denied that a strong bond market sell-off influenced his decision earlier this month to hold off on aggressive \"reciprocal\" tariffs against U.S. trading partners.\n\n\"No, it wasn't for that reason,\" Trump told Time in the interview from Tuesday that was published Friday. \"I'm doing that until we come up with the numbers that I want to come up with. I've met with a lot of countries. I've talked on the telephone. I don't even want them to come in.\"\n\nYields have since moved lower, with the 10-year most recently around 4.28%, about a quarter percentage point higher than its recent low. Trump had said when he made the decision to hold off that the bond market had gotten the \"yips.\"\n\n\"The bond market was getting the yips, but I wasn't. Because I know what we have,\" he said. \"I know what we have, but I also know we won't have it for long if we allowed four more years of the gross incompetence. This thing was just running — it was running as a free spirit. This was — this was the most incompetent president in history.\"\n\nThough negotiations over tariffs are ongoing, Trump added that he would consider it a \"total victory\" even if the U.S. has levies as high as 50% still in place a year from now.\n\nGet Your Ticket to Pro LIVE\n\nJoin us at the New York Stock Exchange!\n\nUncertain markets? Gain an edge with CNBC Pro LIVE, an exclusive, inaugural event at the historic New York Stock Exchange.\n\nIn today's dynamic financial landscape, access to expert insights is paramount. As a CNBC Pro subscriber, we invite you to join us for our first exclusive, in-person CNBC Pro LIVE event at the iconic NYSE on Thursday, June 12.\n\nJoin interactive Pro clinics led by our Pros Carter Worth, Dan Niles and Dan Ives, with a special edition of Pro Talks with Tom Lee. You'll also get the opportunity to network with CNBC experts, talent and other Pro subscribers during an exciting cocktail hour on the legendary trading floor. Tickets are limited!", "publish_ts": 1745539200000, "source": "CNBC Economy"}
{"url": "https://www.cnbc.com/2025/05/28/palantir-teams-up-with-fannie-mae-in-ai-push-to-sniff-out-mortgage-fraud.html", "title": "Palantir teams up with Fannie Mae in AI push to sniff out mortgage fraud", "body": "In this article FMCC\n\nFNMA\n\nPLTR Follow your favorite stocks CREATE FREE ACCOUNT\n\nAlex Karp, CEO of Palantir Technologies, speaks during the Digital X event in Cologne, Germany, on Sept. 7, 2021. Andreas Rentz | Getty Images\n\nQuasi-governmental financial firm Fannie Mae on Wednesday announced a partnership with defense tech player Palantir to detect mortgage fraud, deepening ties between the federal government and a company that has been a big winner in the second Trump administration. Priscilla Almodovar, Fannie Mae CEO, said Wednesday at a press event that the goal is for the firm to \"identify fraud more proactively\" with the help of Palantir, starting with its multi-family housing business. An early test showed that Palantir's technology, which includes elements of artificial intelligence, could identify fraud in seconds that took human investigators two months to find, she said. Shares of Palantir have jumped more than 140% since President Donald Trump's election win in November. The technology stock has roles in both modernizing the U.S. military and helping to cut costs in government, making it a seemingly strong fit for the administration's stated priorities. CEO Alex Karp said Wednesday that the mortgage fraud detection can be done in a way that \"protects the underlying data and protects the privacy of the people submitting their forms.\"\n\nStock Chart Icon Stock chart icon Shares of Palantir have dramatically outperformed the broader stock market since the November election.\n\nFannie Mae and Freddie Mac are government-sponsored enterprises that have been under the conservatorship of the Federal Housing Financing Agency since 2008. The official names of the two enterprises are the Federal National Mortgage Association and the Federal Home Loan Mortgage Corporation, respectively. FHFA director William Pulte said Wednesday the Palantir program could be expanded to Freddie Mac in the future and that the agency is also talking to Elon Musk's xAI firm about a potential partnership. \"The sky's the limit. We're not just limited to fraud. If there are ways to pull cost out of the system, we want to do it,\" Pulte said. The press release did not include a dollar amount that Fannie Mae would pay to Palantir for this service. The announcement comes as there is a push to potentially bring Fannie and Freddie out of conservatorship and re-establish them as something closer to independent companies. \"Our great Mortgage Agencies, Fannie Mae and Freddie Mac, provide a vital service to our Nation by helping hardworking Americans reach the American Dream — Home Ownership,\" Trump said in a Truth Social post on Tuesday. \"I am working on TAKING THESE AMAZING COMPANIES PUBLIC, but I want to be clear, the U.S. Government will keep its implicit GUARANTEES, and I will stay strong in my position on overseeing them as President. These Agencies are now doing very well, and will help us to, MAKE AMERICA GREAT AGAIN!\" The \"implicit guarantee\" mentioned by Trump refers to the idea among investors that the government won't let Fannie and Freddie default on their mortgage-backed securities. That concept is not legally binding but does help that massive market function and, in theory, lead to lower mortgage rates by reducing the perceived risk to investors in the housing market.\n\nwatch now", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/fed-warns-it-could-face-difficult-tradeoffs-if-tariffs-reaggravate-inflation-.html", "title": "Fed worried it could face 'difficult tradeoffs' if tariffs reaggravate inflation, minutes show", "body": "Federal Reserve officials at their meeting earlier this month worried that tariffs could aggravate inflation and create a difficult quandary with interest rate policy, minutes released Wednesday show.\n\nThe summary of the May 6-7 meeting of the Federal Open Market Committee reflected ongoing misgivings about the direction of fiscal and trade policy, with officials ultimately deciding the best course was to keep rates steady.\n\n\"Participants agreed that uncertainty about the economic outlook had increased further, making it appropriate to take a cautious approach until the net economic effects of the array of changes to government policies become clearer,\" the minutes said. \"Participants noted that the Committee might face difficult tradeoffs if inflation proves to be more persistent while the outlooks for growth and employment weaken.\"\n\nThough policymakers expressed concern about the direction of inflation and the vagaries of trade policy, they nevertheless said that economic growth was \"solid,\" the labor market is \"broadly in balance\" though risks were growing that it could weaken, and consumers were continuing to spend.\n\nAs it has done since the last cut in December, the FOMC kept its benchmark federal funds rate in a target between 4.25%-4.5%.\n\n\"In considering the outlook for monetary policy, participants agreed that with economic growth and the labor market still solid and current monetary policy moderately restrictive, the Committee was well positioned to wait for more clarity on the outlooks for inflation and economic activity,\" the summary said.\n\nThe post-meeting statement noted that \"uncertainty about the economic outlook has increased further.\" Also, the committee said meeting its dual goals of full employment and low inflation have been complicated due to policy uncertainty.\n\nSince the meeting, officials have repeated that they will wait until there's more clarity about fiscal and trade policy before they will consider lowering rates again. Market expectations have responded in kind, with futures traders now pricing in virtually no chance of a cut until the Fed's September meeting.\n\nTrade policy also has evolved since the Fed last gathered.\n\nTariffs and ongoing saber-rattling between the U.S. and China eased a few days after the central bank meeting, with both sides agreeing to drop the most onerous duties against each pending a 90-day negotiation period. That in turn helped kindle a rally on Wall Street, though bond yields continue to climb, something President Donald Trump has sought to contain.\n\nAmid the trade war and signs that inflation is slowly coming in toward the Fed's 2% target, Trump has hectored central bank officials to lower rates. Fed Chair Jerome Powell, though, has said the Fed won't be swayed by political interference.\n\nThe meeting also featured discussion about the Fed's five-year policy framework.\n\nWhen officials last visited their long-range policy, they devised what became known as \"flexible average inflation targeting,\" which essentially asserted that officials could allow inflation to run above their 2% target for a while in the interest of promoting more inclusive labor market gains.\n\nIn their discussion, officials noted that the strategy \"has diminished benefits in an environment with a substantial risk of large inflationary shocks\" or rates aren't near zero, where they had been in the years after the 2008 financial crisis. The Fed held interest rates near the lower boundary despite inflation surging following the Covid pandemic, forcing them into aggressive hikes later.\n\nThe minutes noted a desire for policy that is \"robust to a wide variety of economic environments.\" Officials also said they have no intention on altering the inflation goal.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/stocks-making-the-biggest-moves-midday-vail-resorts-gamestop-and-more.html", "title": "Stocks making the biggest moves midday: Abercrombie & Fitch, Okta, Vail Resorts, GameStop and more", "body": "Check out the companies making headlines in midday trading: Abercrombie & Fitch — Shares of the retailer climbed 14.7% after Abercrombie & Fitch's first-quarter earnings and revenue topped Street estimates, led by results at Hollister. Investors looked past A & F cutting its profit guidance and operating margin forecast due to tariffs, which the company said will hit its business by $50 million. Okta — Shares of the identity management software firm declined 16.2% after it left its guidance unchanged, citing macroeconomic uncertainty . The company's first-quarter earnings and revenue came in better than expected. Vail Resorts — The ski resort operator surged 8.7% after Rob Katz returned as CEO , replacing Kirsten Lynch. Katz, the executive chair, served as CEO from 2006 to 2021. Box — Shares soared 17.2% and hit an all-time high after Box's fiscal first-quarter earnings and revenue beat analysts' estimates, according to FactSet. The cloud storage company's forward guidance for the second quarter and full year also came in above expectations. Joby Aviation — The electric vertical takeoff and landing aircraft maker jumped 28.8% after Toyota agreed to make an initial investment of $250 million, part of a total $500 million investment announced last year. GameStop — The meme stock tumbled 10.9% after the video game retailer bought 4,710 bitcoins , worth more than half a billion dollars. GameStop, which had amassed $4.76 billion in cash as of February, began a crypto purchasing plan similar to one made famous by MicroStrategy. The purchase came as bitcoin just hit a record high near $112,000. Capri Holdings — Shares rose 2.8% after the parent company of the Michael Kors and Jimmy Choo brands posted fiscal fourth-quarter revenue of $1.04 billion, exceeding the $1.0 billion analysts had expected, according to FactSet. Capri's full-year earnings guidance of between $1.20 and $1.40 per share was also higher than the $1.02 consensus estimate. Last month, Capri entered into a definitive agreement to sell its Versace unit to Prada Group. Freshpet — The pet food company dropped about 4% after TD Cowen downgraded the stock to hold from buy, saying the company's refrigerated dog food concept is \"nearing a saturation point sooner than expected,\" pointing to a slower pace of sales growth. — CNBC's Yun Li, Lisa Kailai Han, Pia Singh and Michelle Fox contributed reporting.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/stocks-making-the-biggest-moves-premarket-m-gme-dks-joby-and-more.html", "title": "Stocks making the biggest moves premarket: Macy's, GameStop, Dick's Sporting Goods, Joby Aviation and more", "body": "Check out the companies making headlines in premarket trading: Macy's — The department store added more than 2% after the company reported earnings that beat estimates . Macy's also slashed its profit outlook as a result of higher tariffs and more aggressive company promotions. Okta — The identity management software firm pulled back about 10% after standing by its guidance, citing macroeconomic uncertainty. The company did beat fiscal first-quarter expectations on the top and bottom lines, however. Freshpet — The pet food stock dipped nearly 2% following a downgrade to hold from buy at TD Cowen. The investment firm said Freshpet's refrigerated dog food concept is \"nearing a saturation point\" and sales growth could decelerate. Vail Resorts — Shares of the ski resort firm surged more than 12% on the heels of news that Rob Katz returned as CEO . Katz, executive chair of Vail Resorts, previously served as chief executive from 2006 to 2021. He takes the place of Kirsten Lynch. Abercrombie & Fitch — The retailer advanced more than 26% after first-quarter results surpassed analysts' estimates. Abercrombie earned $1.69 per share on revenue of $1.10 billion. Analysts polled by FactSet were looking for $1.36 per share and revenue of $1.06 billion. The firm also issued a higher-than-expected second-quarter earnings outlook. Dick's Sporting Goods — The sporting goods chain climbed 4% after Dick's reported better-than-expected first-quarter results. The firm posted earnings per share of $3.37, excluding items, on revenue of $3.18 billion. Analysts polled by FactSet were looking for $3.21 in earnings per share and revenue of $3.12 billion. Dick's also reaffirmed its full-year outlook. Noble Corporation — Shares of the offshore drilling contractor gained nearly 2% after a JPMorgan upgrade to overweight from neutral. The firm said it sees signs of stabilization in offshore drilling, citing new contract activity for Noble. Box — The stock jumped nearly 11% following the cloud storage company's earnings and revenue beat for its fiscal first quarter. Box also issued second-quarter and full-year guidance that topped expectations. Nvidia — Shares gained roughly 1% ahead of first-quarter results due out after the closing bell on Wednesday. Investors will be looking for any information pertaining to export restrictions to China and the impact on its chips. Joby Aviation — The aviation stock gained more than 10% after the firm announced the closing of the first tranche of a $250 million investment from Toyota. That is part of a $500 million investment first announced last year. GameStop — The video game retailer added more than 3% after announcing the purchase of nearly 5,000 bitcoin . — CNBC's Sean Conlon, Jesse Pound and Michelle Fox contributed reporting.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/gamestop-shares-rise-as-retailer-meme-stock-buys-first-bitcoin-batch-scooping-up-500-million.html", "title": "GameStop drops nearly 11% despite initiating bitcoin buying plan with $500 million purchase", "body": "A general view of the GameStop logo on one of its stores in the city center of Cologne, Germany.\n\nGameStop said Wednesday it has officially bought 4,710 bitcoins, worth more than half a billion dollars, as the video game retailer began its crypto purchasing plan in a similar move made famous by MicroStrategy.\n\nThe purchase, its first investment in bitcoin, was worth $512.6 million with bitcoin's price of $108,837 on Wednesday. The world's largest cryptocurrency has been on a tear lately, hitting a record high near $112,000 last week, as easing trade tensions and the Moody's downgrade of U.S. sovereign debt highlighted alternative stores of value like bitcoin.\n\nShares of GameStop dipped 10.9% Wednesday following the news. As of Feb. 1, the company had amassed a $4.76 billion cash pile, according to its annual report released in April.\n\nCNBC first reported on GameStop's intention to add cryptocurrencies on its balance sheet in February. The company confirmed its plan in late March, saying it has not set a ceiling on the amount of bitcoin it may purchase.\n\nCEO Ryan Cohen made an appearance at the Bitcoin 2025 Conference in Las Vegas Wednesday following the announcement. In a pre-recorded video, he said GameStop's decision to buy bitcoin is driven by macro concerns as the digital coin, with its fixed supply and decentralized nature, could serve as protection against certain risks.\n\n\"If the thesis is correct, bitcoin and gold as well can be a hedge against global currency devaluation and systemic risk,\" he said. \"Bitcoin has certain unique advantages compared to gold, the portability aspect of it. It's instantly transferable across the globe.. It's instantly verified via the blockchain... there's the scarcity element of it as well.\"\n\nGameStop is following in the footsteps of software company MicroStrategy, now known as Strategy , which bought billions of dollars worth of bitcoin in recent years to become the largest corporate holder of the flagship cryptocurrency. That decision prompted a rapid, albeit volatile, rise for Strategy's stock.\n\n\"GameStop is following GameStop's strategy. We're not following anyone else's strategy,\" Cohen said.\n\nGameStop's foray into cryptocurrencies marks the latest effort by Cohen to revive the struggling brick-and-mortar business. Under Cohen's leadership, GameStop has focused on cutting costs and streamlining operations to ensure the company is profitable.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/goldman-backed-starling-bank-profit-drops-amid-covid-loan-issue.html", "title": "Goldman-backed Starling Bank reports 26% profit drop as it flags Covid loan fraud issue", "body": "LONDON — British online lender Starling Bank on Wednesday reported a sharp drop in annual profit, citing an issue with Covid-era business loan fraud and a regulatory fine over financial crime failings.\n\nStarling, which offers fee-free current accounts and lending services via a mobile app, posted profit before tax for the year ending March 31, 2025 of £223.4 million ($301.9 million), down nearly 26% year-over-year.\n\nRevenue at the bank totalled £714 million, up about 5% from £682 million a year ago. However, that marked a slowdown from the more than 50% revenue growth Starling saw in its 2024 fiscal year.\n\nProfits for the year were impacted by a £29 million fine by the U.K.'s Financial Conduct Authority over failings related to Starling's financial crime prevention systems.\n\nStarling also flagged an issue with the Bounce Back Loan Scheme (BBLS) that was designed to provide firms with access to cash during the coronavirus pandemic.\n\nStarling was one of several banks that were approved to lend cash to firms during the Covid-19 outbreak in 2020. The scheme provided a 100% guarantee to lenders, making the government responsible for covering the full outstanding loan amount if a borrower defaulted.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/travel-spending-us-from-overseas-tourists-to-fall-in-2025.html", "title": "Fewer international tourists are visiting the U.S. — economic losses could be 'staggering,' researchers estimate", "body": "Spending from foreign visitors to the U.S. is poised to fall by $8.5 billion this year as negative perceptions tied to trade and immigration policy lead overseas tourists to look elsewhere, according to a research note published by Oxford Economics.\n\nThe spending decline, which works out to a drop of about 5% relative to last year, is a result of less foot traffic. International arrivals to the U.S. are expected to fall about 9% this year, Aran Ryan, director of industry studies at Tourism Economics, part of Oxford Economics, wrote in a research note last week.\n\nBusinesses and geographies that rely on foreign tourists for commerce could be especially hard-hit.\n\nOther estimates suggest the potential economic loss may be even larger.\n\nThe World Travel & Tourism Council said this month it expects the U.S. economy to lose a \"staggering\" $12.5 billion in spending from international visitors in 2025, a \"direct blow to the U.S. economy overall, impacting communities, jobs, and businesses from coast to coast.\"", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/european-businesses-have-never-been-this-gloomy-about-china.html", "title": "European businesses have never been this gloomy about China", "body": "A L 'Oreal store near the Nanjing Road Pedestrian Street in Shanghai, China on April 1, 2025.\n\nBEIJING — European business optimism about China has hit its lowest on record – worse than during the pandemic — due to slower growth and geopolitical worries.\n\nA record 73% of respondents in the EU Chamber of Commerce in China's annual survey said doing business in the Asian country has become more difficult in the past year, marking a new high for a fourth-straight year.\n\nThat's just one of the several record lows in sentiment found in the annual survey, which has been published since 2004. The latest study released Wednesday, covered 503 respondents in January and February.\n\n\"Companies are really feeling the squeeze, being pessimistic, but again finding very compelling supply chains in China that necessitate a continued presence [in] the Chinese market,\" Jens Eskelund, president of the chamber, told reporters this week.\n\nStill, that doesn't mean business confidence is close to returning.\n\n\"We haven't seen an inflection point yet,\" Eskelund said. \"A lot of it boils down to uncertainty.\"\n\nThe survey reflected how challenges for foreign businesses in China have largely increased since the pandemic lockdown in 2022 disrupted supply chains. While local brands have become more competitive, overall consumer demand has remained lackluster amid the real estate slump and uncertainty in the job market.", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/28/china-controlled-rare-earths-account-for-3-pounds-of-an-electric-car-ev.html", "title": "The West is recycling rare earths to escape China’s grip — but it’s not enough", "body": "Annealed neodymium iron boron magnets sit in a barrel prior to being crushed into powder at Neo Material Technologies Inc.'s Magnequench Tianjin Co. factory in Tianjin, China. Bloomberg | Bloomberg | Getty Images\n\nBEIJING — As China tightens its grip on the global supply of key minerals, the West is working to reduce its dependence on Chinese rare earth. This includes finding alternative sources of rare earth minerals, developing technologies to reduce reliance, and recovering existing stockpiles through recycling products that are reaching the end of their shelf life. \"You cannot build a modern car without rare earths,\" said consulting firm AlixPartners, noting how Chinese companies have come to dominate the supply chain for the minerals. In September 2024, the U.S. Department of Defense invested $4.2 million in Rare Earth Salts, a startup that aims to extract the oxides from domestic recycled products such as fluorescent light bulbs. Japan's Toyota has also been investing in technologies to reduce the use of rare earth elements. According to the U.S. Geological Survey, China controlled 69% of rare earth mine production in 2024, and nearly half of the world's reserves. Analysts from AlixPartners estimate that a typical single-motor battery electric vehicle includes around 550 grams (1.21 pounds) of components containing rare earths, unlike gasoline-powered cars, which only use 140 grams of rare earths, or about 5 ounces.\n\nPretty soon, the first generation of EVs will be up for recycling themselves, creating a pool of ex-China material that will be under the control of the West. Christopher Ecclestone Principal and mining strategist at Hallgarten & Company\n\nMore than half of the new passenger cars sold in China are battery-only and hybrid-powered cars, unlike the U.S., where they are still mostly gasoline-powered. \"With slowing EV uptake (in the U.S.) and mandates to convert from ICE to EV formats receding into the future, the imperative for replacing Chinese-sourced materials in EVs is declining,\" said Christopher Ecclestone, principal and mining strategist at Hallgarten & Company. \"Pretty soon, the first generation of EVs will be up for recycling themselves, creating a pool of ex-China material that will be under the control of the West,\" he said.\n\nOnly 7.5% of new U.S. vehicle sales in the first quarter were electric, a modest increase from a year ago, according to Cox Automotive. It pointed out that around two-thirds of EVs sold in the U.S. last year were assembled locally, but manufacturers still rely on imports for the parts. \"The current, full-blown trade war with China, the world's leading supplier of EV battery materials, will distort the market even more.\"\n\nRare torque\n\nOf the 1.7 kilograms (3.74 pounds) of components containing rare earths found in a typical single-motor battery electric car, 550 grams (1.2 pounds) are rare earths. About the same amount, 510 grams, is used in hybrid-powered vehicles using lithium-ion batteries.\n\nIn early April, China announced export controls on seven rare earths. Those restrictions included terbium, 9 grams of which is typically used in a single-motor EV, AlixPartners data showed. None of the six other targeted rare earths are significantly used in cars, according to the data. But April's list is not the only one. A separate Chinese list of metal controls that took effect in December restricts exports of cerium, 50 grams of which AlixPartners said is used on average in a single-motor EV. The controls mean that Chinese companies handling the minerals must get government approval to sell them overseas. Caixin, a Chinese business news outlet, reported on May 15, just days after a U.S.-China trade truce, that three leading Chinese rare earth magnet companies have received export licenses from the commerce ministry to ship to North America and Europe. What's concerning for international business is that there are barely any alternatives to China for obtaining the rare earths. Mines can take years to get operating approval, while processing plants also take time and expertise to establish. \"Today, China controls over 90% of the global refined supply for the four magnet rare earth elements (Nd, Pr, Dy, Tb), which are used to make permanent magnets for EV motors,\" the International Energy Agency said in a statement. That refers to neodymium, praseodymium, dysprosium and terbium.\n\nwatch now\n\nFor the less commonly used nickel metal hydride batteries in hybrid cars, the amount of rare earths goes up to 4.45 kilograms, or nearly 10 pounds, according to AlixPartners. That's largely because that kind of battery uses 3.5 kilograms of lanthanum. \"I estimate that around 70% of the over 200 kilograms of minerals in an EV goes through China, but it varies by vehicle and manufacturer. It's hard to put a definitive figure on it,\" said Henry Sanderson, associate fellow at The Royal United Services Institute for Defence and Security.\n\nPower projection\n\nHowever, there are limits to recycling, which remains challenging, energy-intensive and time-consuming. And even if adoption of EVs in the U.S. slows, the minerals are used in far larger quantities in defense. For example, the F-35 fighter jet contains over 900 pounds of rare earths, according to the Center for Strategic and International Studies, based in Washington, D.C. China's rare earths restrictions also go beyond the closely watched list released on April 4.\n\nLarge rocks containing chromite, is crushed into smaller bitesize chunks, before to goes through a process to refine and extract the ore that yields chromium, a vital component of stainless steel, at the Mughulkhil mine in Logar Province, Afghanistan. Marcus Yam | Los Angeles Times | Getty Images\n\nIn the last two years, China has increased its control over a broader category of metals known as critical minerals. In the summer of 2023, China said it would restrict exports of gallium and germanium, both used in chipmaking. About a year later, it announced restrictions on antimony, used to strengthen other metals and a significant component in bullets, nuclear weapons production and lead-acid batteries. The State Council, the country's top executive body, in October released an entire policy for strengthening controls of exports, including minerals, that might have dual-use properties, or be used for military and civilian purposes.\n\n\n\nSubscribe now Weekly analysis and insights from Asia's largest economy in your inbox", "publish_ts": 1748390400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/27/stocks-making-the-biggest-moves-midday-djt-crm-tsla-amc.html", "title": "Stocks making the biggest moves midday: Trump Media, Salesforce, Tesla, AMC Entertainment and more", "body": "Check out the companies making headlines in midday trading. Chinese autos — Chinese auto stocks retreated after BYD said it would lower prices on 22 electric and plug-in hybrid models until the end of June, igniting fears of a fresh price war in the Chinese market. U.S.-traded shares of Li Auto and Nio respectively slipped 2% and 3%. AMC Entertainment — The movie theater chain saw shares skyrocket 24% after it set a Memorial Day weekend record for revenues on the strength of live-action Lilo & Stitch and Mission: Impossible – The Final Reckoning. Trading volume was extremely heavy during Tuesday's session, more than twice its 30-day average volume of 8.6 million shares as of midday. Newmont — Shares of the gold miner slipped 1% as news of President Donald Trump's delayed tariffs on the European Union dragged down the price of spot gold. The precious metal, seen as a safe-haven asset, was last down more than 1%. V.F. Corporation — Shares surged 13% after the apparel company — which owns brands such as Timberland, The North Face and JanSport — disclosed that president and CEO Bracken Darrell had bought about 85,800 shares . COO Abhishek Dalmia also disclosed buying 50,000 shares . Wingstop — Shares climbed 5% following an upgrade to buy from hold at Truist. Analyst Jake Bartlett noted that customer spending at Wingstop appears to be improving. Nvidia — The graphics processing unit manufacturer added 3% after Reuters reported that Nvidia will be launching a cheaper Blackwell chip exclusively for China. The company plans to start mass production as early as June, Reuters said, citing sources familiar with the matter. LifeStance Health — Shares climbed 10% after UBS upgraded the outpatient behavioral health services provider to a buy rating from neutral. Analyst Kevin Caliendo said that investors may be undervaluing the stock compared to the company's potential performance. Cummins — The industrial components manufacturer added almost 3% following an upgrade to buy from neutral at Goldman Sachs. Analyst Jerry Revich cited strong demand for Cummins' power generation products as a catalyst. Tesla — The electric vehicle maker added 7% after Elon Musk reiterated his intention to redirect his focus back to his companies in a Saturday post on X . The billionaire wrote that he needs to be \"super focused\" on X, artificial intelligence company xAI and Tesla as they go forward with launching \"critical technologies.\" CoreWeave — The AI infrastructure provider surged 21% despite receiving its first Wall Street downgrade following its post-IPO rally. Barclays downgraded shares to equal weight from overweight, citing that upside appears limited in the short term. Informatica , Salesforce — Informatica's stock popped nearly 7% after the cloud data management company said it was being acquired by Salesforce in a deal valued at $8 billion. Informatica's shareholders will receive $25 in cash per share, a roughly 11% premium to Friday's closing price. Salesforce's stock added more than 1%. PDD Holdings — The U.S.-listed shares of PDD Holdings plunged 14% after the Chinese online retailer posted disappointing first-quarter earnings results. The parent company of Temu posted revenue of 95.67 billion yuan ($13.28 billion) that fell short of the FactSet consensus estimate of 103.13 billion yuan ($14.32 billion). Trump Media & Technology — Shares of the social media and tech company fell more than 10% after Trump Media announced that it was raising $2.5 billion in capital to buy bitcoin. SoundHound AI — Shares of the voice AI platform popped 16% after Piper Sandler initiated coverage of SoundHound AI with an overweight rating. The firm highlighted several ways SoundHound can expand its growth runway, including further integrating its conversational AI technology into auto. Champion Homes — Shares dropped more than 16% after the maker of modular homes reported fourth-quarter that missed estimates on the top and bottom lines, while separately announcing it has agreed to acquire manufactured home maker Iseman Homes. Champion Homes posted adjusted earnings of 65 cents per share on revenue of $593.9 million. Analysts polled by FactSet expected earnings of 76 cents per share on revenue of $595.4 million. — CNBC's Michelle Fox, Yun Li, Sarah Min, Jesse Pound and Pia Singh contributed reporting.", "publish_ts": 1748304000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/27/jpmorgan-chase-wealth-management.html", "title": "JPMorgan Chase is heading upmarket to woo America’s millionaires", "body": "JPMorgan Chase thinks it has cracked the code on managing more money for America's millionaires.\n\nIt's not a new financial product, a novel software program or an enticing sign-up bonus. Instead, it's a refurbished take on an old concept — the brick-and-mortar bank branch — along with new standards for service that are at the heart of its aspirations.\n\nThe bank is unveiling 14 of these new format branches — each acquired when JPMorgan took over First Republic in 2023 — in tony ZIP codes in New York, California, Florida and Massachusetts, including Napa, Palm Beach and Wellesley Hills.\n\nIt's part of JPMorgan's push to convince affluent Americans, many who already use Chase checking accounts or credit cards, that the bank is ready to manage their millions.\n\nJPMorgan is the country's biggest bank by deposits and assets and has a top share in areas as disparate as Wall Street trading and retail credit cards. But one of the only major categories where it isn't a clear leader is in wealth management; peers like Morgan Stanley and Bank of America exceed it there.\n\nWhile half of the 19 million affluent households in the U.S. bank with JPMorgan, it has just a 10% share of their investing dollars, according to Jennifer Roberts, CEO of Chase Consumer Banking.\n\n\"We have this giant opportunity to convince customers to have their wealth management business with us in addition to their deposit relationship,\" Roberts said in a recent interview.\n\nHelped by its acquisition of First Republic, which was known for catering to rich families living on either coast, JPMorgan decided to launch a new tier of service. Called J.P. Morgan Private Client, it is anchored by the new physical locations, of which there will be 31 by the end of next year.\n\nThe service comes with its own mobile banking app, but its main appeal is the in-person experience: Instead of being handed off to multiple employees like at a Chase branch, J.P. Morgan Private Client members are assigned to a single banker.\n\n\"What First Republic did really well was deliver a concierge-level of service where if you have an issue, a person owned it for you and you didn't have to worry about it,\" Roberts said. \"So with this experience we are going to deliver a more elevated concierge type of service, like you would expect at a high-end hotel.\"\n\nThe price of entry: at least $750,000 in deposits and investments, though Roberts said the bank is aiming for those with around $2 million to $3 million in balances.", "publish_ts": 1748304000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/27/stocks-making-the-biggest-moves-premarket-x-tsla-pdd-crwv.html", "title": "Stocks making the biggest moves premarket: Tesla, Informatica, Newmont, CoreWeave and more", "body": "Check out the companies making headlines before the bell. Newmont — The gold miner's stock shed 2% alongside the decline in the precious metal's price. Spot gold, considered a safe haven, was down 1.5% after President Donald Trump delayed tariffs on the European Union. Tesla — Shares of the electric vehicle maker rose more than 2% after CEO Elon Musk said in a Saturday post on X he will give greater attention to his companies, writing: \"I must be super focused on /xAI and Tesla (plus Starship launch next week), as we have critical technologies rolling out.\" Musk has been criticized for focusing too much on his work with the Trump administration. Tesla has notably suffered due to Musk's political work, and its Europe April sales were down 49% year-on-year , according to fresh data from the European Automobile Manufacturers' Association. CoreWeave — Shares rose more than 4%, even after the stock got its first Wall Street downgrade since its post-IPO rally. Barclays downgraded CoreWeave to equal weight from overweight on Monday, saying it is optimistic on the stock for the long run but that short-term upside is limited. Informatica , Salesforce — Informatica shares jumped 6.5% on news that the cloud data management company is being acquired by Salesforce, whose shares rose 1%. The deal is valued at $8 billion and is expected to boost Salesforce's AI component. A deal between the two companies fell apart last year. PDD Holdings — The U.S.-listed shares of the Chinese online retailer tumbled more than 20% after the company posted disappointing first-quarter earnings results , amid rising trade tensions between the U.S. and China. The parent company of Temu posted revenue of 95.67 billion yuan ($13.28 billion) that fell short of the FactSet consensus estimate of 103.13 billion yuan ($14.32 billion). Trump Media & Technology Group — Shares of the Truth Social parent company jumped about 9% after the Financial Times reported that the company plans to raise $2 billion in fresh equity and $1 billion through a convertible bond, in order to spend on cryptocurrencies. SoundHound AI — Piper Sandler initiated coverage of the AI stock with an overweight rating, leading shares 4.3% higher in early morning trading. The firm highlighted several areas SoundHound can expand its growth runway, including further integration of its conversational AI technology into auto. Champion Homes — Shares of the company, which produces of factory-built housing in North America, slipped 1.5% on the back of lackluster fourth-quarter financial results. Champion posted adjusted earnings of 65 cents per share on revenue of $593.9 million, while analysts polled by FactSet called for earnings of 76 cents per share, excluding items, on revenue of $595.4 million. Champion also announced an agreement to acquire Iseman Homes, which sells manufactured and modular homes in the Midwest. — CNBC's Sarah Min, Jesse Pound and Michelle Fox contributed reporting.", "publish_ts": 1748304000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/26/xiaomi-takes-aim-at-tesla-bestselling-car-in-china-with-longer-range.html", "title": "Xiaomi takes aim at Tesla's bestselling car in China with its longer-range YU7", "body": "Xiaomi revealed its first electric SUV, the YU7, in Beijing on May 22, 2025, and said its full launch would be held in July.\n\nBEIJING — China's Xiaomi , known for its smartphones, only recently entered the electric-vehicle space. It is now taking aim at Tesla's bestselling car in China.\n\nLess than a year after launching its first electric car, Xiaomi late on Thursday revealed its YU7 SUV and claimed it would have a driving range of at least 760 kilometers (472 miles) on a single charge.\n\nThat's well above the 719 km advertised for Tesla's extended-range Model Y. Driving range has been a selling point for consumers worried about frequent battery charging.\n\n\"We expect Yu7 would significantly erode Tesla Model-Y's China market share,\" Citi analyst Jeff Chung said in a report Sunday.\n\nCiti expects the YU7 to be priced around 250,000 yuan to 320,000 yuan ($34,700 to $44,420), and forecasts monthly sales of about 30,000 units. Once sales pick up, Citi predicts annual sales of 300,000 to 360,000 units.\n\nThat price range pits the YU7 against Tesla's Model Y, which starts at 263,500 yuan in China. Xiaomi plans to announce the YU7's price at the car's official launch in July.", "publish_ts": 1748217600000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/25/ai-drives-growth-for-a-few-chinese-companies-analysts-share-picks.html", "title": "AI drives growth for a few Chinese companies. Analysts share their picks", "body": "Spending on artificial intelligence helped give some Chinese tech companies a boost in the first quarter, despite economic headwinds. \"The standout for this [first quarter] reporting season was the growth in cloud business for Alibaba and Baidu ,\" said Brian Tycangco, an analyst at Stansberry Research. Alibaba said earlier this month its cloud revenue in the latest quarter rose by 18% year on year , while Baidu on Wednesday said its AI cloud business grew by 42% . \"At these rates of growth, cloud business is poised to become the 2nd largest business segment for both companies,\" Tycangco said. \"More importantly, cloud will become the basis for a return to heady growth days after several years of single-digit topline growth.\" Alibaba, Tencent and JD.com also reported double-digit growth in marketing revenue, which they said were bolstered by AI tools that were able to target consumers more effectively. The trend signals a fundamental change in Chinese markets. \"AI/Tech/New Economy [are] further gaining traction as equity market leaders,\" Morgan Stanley's chief China equity strategist Laura Wang said in a May 20 note. \"We believe that a new generation of equity market leaders is forming in these sectors, after a 5-year-long disruption period post market peak in early 2021,\" she said, noting how consumer and internet stocks previously led gains. Out of Morgan Stanley's 60 Chinese AI stock picks, those rated overweight, traded in Hong Kong and with expected upside of more than 50% as of May 19 are: Gushengtang — This health-care company is focused on traditional Chinese medicine, and it's training targeted AI models to create an \"AI physician assistant.\" The company said customer visits rose by 12.7% in the first quarter to 1.21 million. Bairong — This cloud-based AI services company is focused on state-owned banks and other financial services companies. The company added in its 2024 annual report that Alibaba's Taobao and Tmall e-commerce platforms use Bairong's AI model service to evaluate consumers' purchasing power. When it comes to more popular names, the Morgan Stanley analysts prefer Alibaba and Tencent over Baidu and iFlytek. They also prefer Meituan, Meitu and Trip.com over Kuaishou and JD.com. Among mainland China-listed companies, 68% mentioned AI in their 2024 annual reports, up from 43% in the first half of 2024, HSBC Qianhai Securities head of research Steven Sun, said in a May 16 report. “We also observed a slightly upward revision of 2025e consensus capex for major cloud service providers after 1Q25 results, suggesting they are still upbeat about their AI business.” The information technology sector saw earnings rise by 24.7% in the first quarter from a year ago on improving AI penetration, the HSBC report said, noting it was one of the fastest-growing sectors. One of HSBC's buy-rated picks is enterprise software and cybersecurity company Sangfor, listed in Shenzhen, with a price target of 143 yuan. The firm thinks accelerating AI adoption can help drive earnings growth. Chinese-developed DeepSeek surprised global investors in late January with its ability to rival OpenAI's ChatGPT, while claiming a fraction of development cost. In the months since, several Chinese companies have also released new AI tools for generating video or 3D models. China's recent tech breakthroughs stem from the country's breadth of engineers, data and vast social media and e-commerce ecosystem, the Morgan Stanley analysts said, noting how government support can enable faster tech adoption. \"We continue to believe that such structural improvement would be less susceptible to the ongoing tariff dispute and the overall macro challenges,\" the report said. “This is important in attracting foreign investors to build long-term commitments of allocation, as they discover a decent number of companies that are distinctive and exclusively available in China, despite the broad macro slowdown.” Listed Chinese stocks generate the majority of their revenue domestically, with only 3% U.S. revenue exposure, the analysts said. — CNBC's Michael Bloom contributed to this report.", "publish_ts": 1748131200000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/23/stocks-making-the-biggest-moves-midday-aapl-rost-intu-bah.html", "title": "Stocks making the biggest moves midday: Apple, Ross Stores, Intuit, Booz Allen Hamilton and more", "body": "Check out the companies making headlines in midday trading: Booz Allen Hamilton — Shares of the consulting firm lost 15% after Booz Allen Hamilton said it would cut roughly 2,500 jobs, or 7% of its workforce, citing a slowdown in some government spending under the Trump administration and expected ongoing pressure on its business in the first half of the fiscal year. Intuit — Shares of Intuit, which owns TurboTax and QuickBooks software, popped 7.5% after the company reported strong quarterly results . Intuit said its revenue in the fiscal third quarter increased 15% to $7.8 billion. Apple — The tech giant's stock slid 2.6% after President Donald Trump threatened that Apple will have to pay a tariff of 25% or more for iPhones made outside the U.S. Production of Apple's flagship phone happens primarily in China, but the company has been shifting manufacturing to India amid Trump's trade war. Nuclear stocks — Stocks tied to nuclear energy got a bump after Reuters reported , citing sources, that Trump will sign orders to boost nuclear power as soon as Friday. Shares of Oklo and NuScale popped 24% and 14.5%, respectively, while Cameco rose 9%. Constellation Energy added 2.8%. Ross Stores — Shares fell 11% after the off-price retailer withdrew its full-year forecasts , citing uncertainty around tariffs. Ross Stores' second-quarter earnings guidance was also below Wall Street's expectations. Deckers Outdoor — The Ugg boots maker saw its shares drop 19% after Deckers declined to provide full-year guidance for fiscal 2026, citing \"macroeconomic uncertainty related to evolving global trade policies.\" Wolfspeed — Shares of the semiconductor components maker plunged 13%. The company is preparing to file for bankruptcy within weeks. StepStone Group — The investment firm climbed more than 4% after results for the fiscal first-quarter beat expectations. StepStone reported adjusted earnings per share of 68 cents, while analysts surveyed by FactSet were expecting 44 cents per share. Adjusted revenue of $295.9 million was also ahead of a $229.4 million projection. Workday — Shares of the human resources software company dropped 11.8%. Workday issued second-quarter subscription revenue forecast of $2.16 billion, which came in line with the consensus estimate of analysts polled by StreetAccount. Tesla — The electric vehicle maker fell slightly even after Wedbush Securities analyst Dan Ives lifted his price target on Tesla shares ahead of the company's expected robotaxi launch in Austin, Texas, next month. \"The golden age of autonomous is now on the doorstep for Tesla,\" the analyst said. — CNBC's Alex Harring, Jesse Pound, Yun Li and Michelle Fox contributed reporting.", "publish_ts": 1747958400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/23/goolsbee-says-fed-now-has-to-wait-longer-before-moving-rates-because-of-trade-policy-uncertainty.html", "title": "Goolsbee says Fed now has to wait longer before moving rates because of trade policy uncertainty", "body": "Chicago Federal Reserve President Austan Goolsbee said Friday that President Donald Trump's latest tariff threats have complicated policy and likely put off changes to interest rates.\n\nIn a CNBC interview, the central bank official indicated that while he still sees the direction of rates being lower, the Fed likely will be on hold as it evaluates the ever-changing trade policy and how it affects inflation and employment.\n\n\"Everything's always on the table. But I feel like the bar for me is a little higher for action in any direction while we're waiting to get some clarity,\" Goolsbee said on \"Squawk Box\" when asked about Trump's new actions Friday morning. \"Over the longer run, if they're putting in place tariffs that have a stagflationary impact … then that's the central bank's worst situation.\"\n\n\"So I think we'll have to see how big the impacts on prices are,\" he added. \"I know people hate inflation.\"\n\nGoolsbee spoke as Trump jolted markets again with a call for 50% tariffs on products from the European Union starting June 1, while indicating Apple will have to pay a 25% tariff on iPhones not made in the U.S. Apple mostly makes its coveted smartphones in China, though there is some production in India as well.\n\nWhile the impact of a costlier iPhone likely wouldn't mean much from a larger economic perspective, the saber-rattling underscores the volatility of trade policy and provides another flash point for a market already unnerved by worries about fiscal policy that have sent bond yields sharply higher.\n\nCentral bankers are generally careful not to wade into issues of fiscal and trade policy, but are left to analyze their repercussions.\n\nGoolsbee said he is still optimistic that the longer-run trajectory is toward solid economic growth before Trump's April 2 tariff announcement that rattled markets.\n\n\"I'm still underneath hopeful that we can get back to that environment, and 10 to 16 months from now, rates could be a fair bit below where they are today,\" he said.\n\nGoolsbee is a voting member this year on the rate-setting Federal Open Market Committee, which next meets June 17-18. At the meeting, officials will get a chance to update their economic and interest rate projections. The last update, in March, saw the committee indicating two rate cuts this year.\n\nMarkets expect the Fed will cut twice this year, with the next move not happening until September. Goolsbee did not commit to a course of action from here amid the uncertainty.\n\n\"I don't like even mildly tying our hands at the next meeting, much less over six, eight, 10 meetings from now,\" he said. \"That said, as we went into April 2, I believe that we're at pretty stable full employment, that inflation was on a path back to 2% and if we could do those, I thought that over the next 12 to 18 months, rates could come down a fair amount.\"\n\nThe Fed's benchmark overnight borrowing rate is targeted between 4.25% and 4.50%, where it has been since December. The actual rate most recently traded at 4.33%.", "publish_ts": 1747958400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/23/personal-finance-app-monarch-raises-75-million.html", "title": "Personal finance app Monarch raises $75 million despite 'nuclear winter' for fintech startups", "body": "The personal finance startup Monarch has raised $75 million to accelerate subscriber growth that took off last year when budgeting tool Mint was shut down, CNBC has learned.\n\nThe fundraising is among the largest for an American consumer fintech startup this year and values the San Francisco-based company at $850 million, according to co-founder Val Agostino. The Series B round was led by Forerunner Ventures and FPV Ventures.\n\nMonarch aims to provide an all-in-one mobile app for tracking spending, investments and money goals. The field was once dominated by Mint, a pioneer in online personal finance that Intuit acquired in 2009. After the service languished for years, Intuit closed it in early 2024.\n\n\"Managing your money is one of the big unsolved problems in consumer technology,\" Agostino said in a recent Zoom interview. \"How American families manage their money is still basically the same as it was in the late 90s, except today we do it on our phones instead of walking into a bank.\"\n\nMonarch, founded in 2018, saw its subscriber base surge by 20 times in the year after Intuit announced it was closing Mint as users sought alternatives, according to Agostino.\n\nUnlike Mint, which was free, Monarch relies on paying subscribers so that the company doesn't need to focus on advertising from credit-card issuers or sell users' data, said Agostino, who was an early product manager at Mint.", "publish_ts": 1747958400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/23/stocks-making-the-biggest-moves-premarket-aapl-oklo-intu-rost.html", "title": "Stocks making the biggest moves premarket: Apple, Tesla, Intuit, Ross Stores and more", "body": "Check out the companies making headlines before the bell: Apple — The tech giant saw shares fall 3.5% in premarket trading after President Donald Trump said in a social media post that Apple will have to pay a tariff of 25% or more for iPhones made outside the U.S. Nuclear stocks — Stocks tied to nuclear energy rose as a group after Reuters reported , citing sources, that Trump will sign orders to boost nuclear power as soon as Friday. Shares of Oklo and NuScale rallied more than 8% each. Constellation Energy gained 2%, while Cameco rose 4%. Intuit — Shares rallied nearly 8% after the tax software company issued a rosy full-year outlook. Intuit expects adjusted earnings in the range of $20.07 to $20.12 per share, up from its previous guidance of $19.16 to $19.36 per share. Analysts expected $19.40 in earnings per share, according to consensus estimates from FactSet. The company's fiscal third-quarter also beat expectations. Ross Stores — The stock sank more than 12% after the off-price retailer withdrew its previously announced full-year guidance, citing the varying nature of tariff announcements. Its second-quarter earnings guidance also fell short of expectations. Ross Stores said it anticipates pressure on profitability if tariffs stay at elevated levels. Deckers Outdoor — Shares plunged 19% after the maker of Ugg boots declined to provide full-year guidance for fiscal 2026. Deckers Outdoor cited \"macroeconomic uncertainty related to evolving global trade policies.\" On the other hand, fourth-quarter results exceeded expectations on the top and bottom lines, according to LSEG. Tesla — Shares of the electric vehicle maker fell 1.1% even after Wedbush Securities analyst Dan Ives lifted his price target on Tesla shares. Ives said he believes \"the golden age of autonomous is now on the doorstep for Tesla\" ahead of the company's expected robotaxi launch in Austin, Texas, next month. Workday — Shares dropped more than 8% after the human resources software company issued second-quarter subscription revenue forecast of $2.16 billion, which matched the StreetAccount consensus estimate. However, the company's first-quarter results surpassed expectations on the top and bottom lines. StepStone Group — Shares gained more than 5% after the private market investment firm reported assets under management jumped to $189.4 billion in the fiscal fourth quarter, up from $156.6 billion in the year-ago period. Autodesk — Shares rose more than 1% after the software company issued a second-quarter outlook that beat expectations. AutoDesk expects current-quarter adjusted earnings in the range of $2.44 to $2.48 per share, with revenue of $1.72 billion to $1.73 billion. Analysts surveyed by LSEG were anticipating earnings of $2.34 per share and revenue of $1.70 billion. Xerox — The stock fell more than 9% after Xerox updated its capital allocation policy ahead of its planned acquisition of Lexmark, saying it is cutting its dividend by 80% to 2.5 cents from 12.5 cents previously. It reiterated its fiscal 2025 outlook. — CNBC's Michelle Fox, Alex Harring, Yun Li and Pia Singh contributed reporting.", "publish_ts": 1747958400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/23/house-republican-big-beautiful-tax-bill-favors-the-rich.html", "title": "House Republican tax bill favors the rich — how much they stand to gain, and why", "body": "Staff members remove a sign following a press conference after the House passage of the tax and spending bill, at the U.S. Capitol on May 22, 2025 in Washington, DC. Kevin Dietsch | Getty Images\n\nThere's a stark contrast between the effects on high earners and those on low-income households in a sprawling legislative package House Republicans passed Thursday. The bulk of the financial benefits in the legislation — called the \"One Big Beautiful Bill Act\" — would flow to the wealthiest Americans, courtesy of tax-cutting measures such as those for business owners, investors and homeowners in high-tax areas, experts said. However, low earners would be worse off, they said. That's largely because Republicans partially offset those tax cuts — estimated to cost about $4 trillion or more — with reductions to social safety net programs such as Medicaid and the Supplemental Nutrition Assistance Program, or SNAP, formerly known as food stamps. The tax and spending package now heads to the Senate, where it may face further changes.\n\n'It skews pretty heavily toward the wealthy'\n\nThe Congressional Budget Office, a nonpartisan federal scorekeeper, estimates income for the bottom 10% of households would fall by 2% in 2027 and by 4% in 2033 as a result of the bill's changes. By contrast, those in the top 10% would get an income boost from the legislation: 4% in 2027 and 2% in 2033, CBO found.\n\nwatch now\n\nA Yale Budget Lab analysis found a similar dynamic. The bottom 20% of households — who make less than $14,000 a year — would see their annual incomes fall about $800 in 2027, on average, Yale estimates. The top 20% — who earn over $128,000 a year — would see theirs grow by $9,700, on average, in 2027. The top 1% would gain $63,000. The Yale and CBO analyses don't account for last-minute changes to the House legislation, including stricter work requirements for Medicaid. \"It skews pretty heavily toward the wealthy,\" said Ernie Tedeschi, director of economics at the Yale Budget Lab and former chief economist at the White House Council of Economic Advisers during the Biden administration. The legislation compounds the regressive nature of the Trump administration's recent tariff policies, economists said. \"If you incorporated the [Trump administration's] hike in tariffs, this would be even more skewed against lower- and working-class families,\" Tedeschi said.\n\nMost tax cuts in the bill go to top-earning households\n\nThere are several ways the House bill skews toward the wealthiest Americans, experts said. Among them are more valuable tax breaks tied to business income, state and local taxes and the estate tax, experts said. These tax breaks disproportionately flow to high earners, experts said. For example, the bottom 80% of earners would see no benefit from the House proposal to raise the SALT cap to $40,000 from the current $10,000, according to the Tax Foundation. More from Personal Finance:\n\nTax bill includes $1,000 baby bonus in 'Trump Accounts'\n\nHouse bill boosts maximum child tax credit to $2,500\n\nFood stamps face 'biggest cut in the program's history' The bill also preserves a lower top tax rate, at 37%, set by the 2017 Tax Cuts and Jobs Act, which would have expired at the end of the year. It kept a tax break intact that allows investors to shield their capital gains from tax by funneling money into \"opportunity zones.\" Trump's 2017 tax law created that tax break, with the aim of incentivizing investment in lower-income areas designated by state governors. Taxpayers with capital gains are \"highly concentrated\" among the wealthy, according to the Tax Policy Center. All told, 60% of the bill's tax cuts would go to the top 20% of households and more than a third would go to those making $460,000 or more, according to the Tax Policy Center. \"The variation among income groups is striking,\" the analysis said.\n\nWhy many low earners are worse off\n\nThat said, more than 8 in 10 households overall would get a tax cut in 2026 if the bill is enacted, the Tax Policy Center found. Lower earners stand to benefit from provisions including a higher standard deduction and temporarily enhanced child tax credit, and tax breaks tied to tip income and car loan interest, for example, experts said. However, some of those benefits may not be as valuable as they seem at first glance, experts said. For example, roughly one-third of tipped workers don't pay federal income tax, Tedeschi said. They wouldn't benefit from the proposed tax break on tips — it's structured as a tax deduction, which doesn't benefit households without tax liability, he said.\n\nwatch now\n\nMeanwhile, lower-income households, which rely more on federal safety net programs, would see cuts to Medicaid, SNAP, and benefits linked to student loans and Affordable Care Act premiums, said Kent Smetters, an economist and faculty director at the Penn Wharton Budget Model. The House bill would, for example, impose work requirements for Medicaid and SNAP beneficiaries. Total federal spending on those programs would fall by about $700 billion and $267 billion, respectively, through 2034, according to the Congressional Budget Office analysis. That said, \"if you are low income and don't get SNAP, Medicaid or ACA premium support, you will be slightly better off,\" Smetters said.\n\nSome high earners would pay more in tax", "publish_ts": 1747958400000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/stocks-making-the-biggest-moves-after-hours-intu-wday-rost-deck.html", "title": "Stocks making the biggest moves after hours: Intuit, Workday, Ross Stores, Deckers and more", "body": "Check out the companies making headlines in extended trading. Ross Stores — Shares pulled back more than 11%. Ross withdrew its earlier full-year guidance . The off-price retailer said that it expects second-quarter earnings to range from $1.40 to $1.55 per share, while analysts polled by LSEG sought $1.65 per share. Ross also said that it expects pressure on its profitability if tariffs remain at elevated levels. AutoDesk — Shares gained more than 2% after the software company issued a higher-than-expected second-quarter outlook. AutoDesk forecast adjusted earnings in the current quarter in the range of $2.44 to $2.48 per share on revenue of $1.72 billion to $1.73 billion. Analysts polled by LSEG were looking for $2.34 cents per share and revenue of $1.70 billion. Intuit — Shares of the tax software company gained about 8% after Intuit forecast a rosy outlook for the full year. The firm forecast adjusted earnings in the range of $20.07 to $20.12 per share, up from its earlier guidance of $19.16 to $19.36 per share. FactSet consensus estimates sought $19.40 per share. Fiscal third-quarter results also topped estimates. Workday — The human resources software company pulled back more than 6% after forecasting subscription revenue in the second quarter of $2.16 billion, which matched the StreetAccount consensus estimate. The company's first-quarter results surpassed analyst estimates on the top and bottom lines. StepStone Group — Shares of the private market investment firm surged 13%. Assets under management surged to $189.4 billion in the fiscal fourth quarter, up from $156.6 billion in the year-ago period. Deckers Outdoor — The maker of Ugg boots saw shares slide 14%. Deckers declined to provide full-year guidance for fiscal 2026, citing \"macroeconomic uncertainty related to evolving global trade policies.\" Fourth-quarter results beat LSEG consensus expectations on the top and bottom lines, however. — CNBC's Darla Mercado contributed reporting", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/ray-dalio-says-to-fear-the-bond-market-as-deficit-becomes-critical.html", "title": "Ray Dalio says to fear the bond market as deficit becomes critical", "body": "Billionaire investor Ray Dalio on Thursday sounded another alarm on soaring U.S. debt and deficits, saying it should make investors fearful of the government bond market.\n\n\"I think we should be afraid of the bond market,\" Dalio said at an event for the Paley Media Council in New York. \"It's like ... I'm a doctor, and I'm looking at the patient, and I've said, you're having this accumulation, and I can tell you that this is very, very serious, and I can't tell you the exact time. I would say that if we're really looking over the next three years, to give or take a year or two, that we're in that type of a critical, critical situation.\"\n\nThe founder of Bridgewater Associates, one of the world's largest hedge funds, has warned about the ballooning U.S. deficit for years. Recently, investors have begun demanding lower prices to buy the bonds that cover the government's massive budget deficits, pushing up yields on the debt. Rising worries about the fiscal situation last week triggered a high-profile credit rating downgrade from Moody's.\n\nThe yield on the 30-year Treasury yield on Thursday traded at levels not seen since 2023, around 5.14%.\n\nRising financing costs along with continued spending growth and declining tax receipts have combined to send deficits spiraling, pushing the national debt past the $36 trillion mark. In 2024, the government spent more on interest payments than any other outlay other than Social Security, defense and health care.\n\n\"We will have a deficit of about 6.5% of GDP — that that is more than the market can bear,\" Dalio said.\n\nDalio said he's not hopeful politicians would be able to reconcile their differences and lessen the country's debt load. In a party-line vote early Thursday, House members approved legislation that lowers taxes and adds military spending. The bill — which now goes to the Senate — could increase the U.S. government's debt by trillions and widen the deficit at a time when fears of a flare-up in inflation due higher tariffs are already weighing on bond prices and boosting yields.\n\n\"I'm not optimistic. I have to be realistic,\" Dalio said. \"I think it's the essence of the challenge of our country that anything related to bipartisanship and getting over political hurdles ... essentially means 'give me more,' which leads to these deficits.\"", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/dealmaking-activity-shows-trump-tariffs-derailed-a-budding-ma-boom.html", "title": "Dealmaking rebounds after Trump's tariffs cut off a budding M&A boom", "body": "People walk by the New York Stock Exchange (NYSE) on June 18, 2024 in New York City.\n\nHopes for an active year of mergers and acquisitions could be back on track after being briefly derailed by the Trump administration's sweeping tariff policies last month.\n\nDealmaking in the U.S. was off to a strong start this year before President Donald Trump announced tariff policies that led to extremely volatile market conditions that put a chill on activity. In a pre-tariffs world, dealmakers were encouraged by the Trump administration's pro-business flavor and deregulatory agenda, as well as previously easing concerns about inflation. Those trends were expected to fuel an even stronger M&A comeback in 2025, after last year's moderate recovery from a slow 2023.\n\nThis year's appetite for dealmaking came back quickly after Trump suspended his highest tariffs and market jitters took a backseat. If borrowing costs remain in check, many expect activity could be brisk.\n\n\"More clarity on trade policy and rebounding equities markets have set the stage for continued M&A, even in sectors hit especially hard by tariffs,\" Kevin Ketcham, a mergers and acquisitions analyst at Mergermarket, told CNBC.\n\nThe total value of U.S. deals jumped to more than $227 billion in March, which saw 586 deals, before suddenly slowing down in April to roughly 650 deals worth about $134 billion, according to data compiled by Mergermarket.\n\nSo far this month, activity is rebounding and the average deal has been larger. More than 300 deals collectively valued at more than $125 billion have been struck this month as of May 20, Mergermarket said.\n\nThat's encouraging. After Trump's \"liberation day\" tariff announcement, U.S. deal activity plunged by 66% to $9 billion during the first week of April from the prior week, while global M&A activity dropped by 14% week over week to $37.8 billion, according to the data.", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/stocks-making-the-biggest-moves-midday-urbn-aap-snow-run-and-more.html", "title": "Stocks making the biggest moves midday: Urban Outfitters, Advance Auto Parts, Snowflake, Sunrun and more", "body": "Check out the companies making headlines in midday trading. Advance Auto Parts — Shares skyrocketed 57% following a better-than-expected report from the car part retailer. The company lost an adjusted 22 cents per share in the third quarter, narrower than the loss of 82 cents per share anticipated by analysts polled by LSEG. Revenue came in at $2.58 billion, ahead of Wall Street's $2.50 billion forecast. Health insurance stocks — Shares fell after the Centers for Medicare & Medicaid Services announced an aggressive expansion of Medicare Advantage audits. Humana dropped more than 7%, while CVS Health lost 3%. UnitedHealth ticked just over 2% lower. Urban Outfitters — The retailer surged 23% on a stronger-than-expected earnings report for the first quarter. Urban earned $1.16 per share on revenue at $1.33 billion. Analysts surveyed by LSEG penciled in earnings per share of 84 cents and $1.29 billion in revenue. Snowflake — The data storage stock rallied 13.4% after first-quarter earnings surpassed Wall Street's predictions. Snowflake earned 24 cents, excluding items, on $1.04 billion in revenue. Analysts anticipated 21 cents in earnings per share and $1.01 billion in revenue. Sunrun — The solar stock sank more than 37%, one of many in the sector to sell off after the House Republican tax bill appeared to be worse for green energy work than initially feared. SolarEdge and Enphase plunged more than 24% and 19%, respectively. Array Technologies and Nextracker each slid more than 3%, while First Solar both fell more than 4%. Analog Devices — The semiconductor manufacturer lost 4.6% despite beating expectations for the second fiscal quarter and offering upbeat guidance. Analog Devices earned $1.85 per share, excluding items, on $2.64 billion in revenue, while analysts polled by FactSet anticipated earnings of $1.70 per share and $2.51 billion in revenue. Pitney Bowes — Shares jumped 9.5% after the shipping firm announced that sitting director Kurt Wolf was appointed CEO. Wolf is succeeding Lance Rosenzweig, who is retiring from the chief executive role but will be a consultant to the company. Seagate Technology — The data storage company gained 4.2% after the firm announced a $5 billion share repurchase plan at its investor day. The buyback program will carry through the fiscal year ending in 2028, the company said. Williams-Sonoma — Shares of the high-end home furnishings retailer dropped 4.5% due to disappointing corporate guidance, which overshadowed quarterly figures that beat expectations. Dana — The vehicle product supplier popped 2.8% on the back of an upgrade by RBC to outperform from sector perform. RBC called the company's fundamentals \"misunderstood.\" — CNBC's Yun Li contributed reporting", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/trump-tariffs-wont-revive-us-factory-jobs-wells-fargo-analysis-says.html", "title": "Trump's tariffs won't lead to a resurgence of U.S. manufacturing jobs, Wells Fargo analysis says", "body": "President Donald Trump's tariffs are designed to provide incentives to bring manufacturing jobs back to the United States, but the goal isn't as feasible as it appears, according to an analysis from Wells Fargo. Moving factory work back to the U.S would mean a significant increase in labor costs, which many companies simply could not afford, the Wall Street bank said. Even if they are willing to absorb or pass the higher prices onto consumers, companies are challenged by an already tight labor market for production workers. \"A meaningful increase in factory jobs does not appear likely in the foreseeable future, in our view,\" Sarah House, senior economist at Wells Fargo, said in a research report. \"Higher prices and policy uncertainty may weigh on firms' ability and willingness to expand payrolls.\" The Trump administration believes a reshoring boom is on the horizon in the wake of a trade war that brings the effective tariff rate facing importers to the highest level since the 1940s, even accounting for the recent pause on some of the heaviest duties. Trump has also promised tax cuts for companies that bring back manufacturing to the U.S. There have been a few of high-profile announcements from the tech sector , including Nvidia's plans for a supercomputer plant in the U.S. and Apple's commitment to invest $500 billion at home. 'Uphill battle' Still, restoring manufacturing employment back to its heyday seems to be a fool's errand, according to Wells Fargo. Currently the country has 12.8 million manufacturing jobs, 6.7 million fewer than its 1979 peak. In order to bring the sector back to its golden era, employment would need to rise by roughly 22 million jobs. However, there are only 7.2 million unemployed people in the U.S., Wells Fargo said. \"Returning U.S. manufacturing employment to a level that remotely resembles its historical peak will be an uphill battle,\" Wells Fargo said.", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/chinas-xiaomi-claims-new-phone-chip-rivals-apple-at-a-cheaper-price.html", "title": "China’s Xiaomi claims new phone chip rivals Apple at a cheaper price", "body": "BEIJING — Chinese smartphone company Xiaomi is taking on Apple's iPhone with an advanced chip and a cheaper phone.\n\nXiaomi is winning the battle on the pricing of its latest phone. The new Xiaomi 15S Pro starts at 5,499 yuan ($764) — making it eligible for a state-subsidized discount — and is significantly cheaper than Apple models containing the company's most advanced phone chip. The iPhone 16 Pro starts at 7,999 yuan, while the iPhone Pro Max model begins at 9,999 yuan — above the 6,000 yuan cut-off for a Chinese government discount for consumers.\n\nAnd Xiaomi CEO Lei Jun claims his company also has a competitive chip, saying at a launch event on Thursday that Xiaomi's new Xring O1 beat Apple's A18 Pro on several technical metrics, including the ability to operate a game with less heat.\n\nCNBC has not independently verified these claims. CNBC has reached out to Apple for comment.\n\n\"Apple is still number one,\" Lei said in Mandarin, according to a CNBC translation. He said the Xring O1's performance should not be seen as an attempt to pressure Apple, but rather as an indicator of the great effort Xiaomi made to develop a comparable processor.\n\nThe U.S. has increasingly restricted China's ability to access high-end equipment for developing advanced semiconductors used in training artificial intelligence models.\n\nLei did not discuss any significant AI features for the 15S Pro, but showed how it could be used to lock and unlock a compatible car.\n\nHe announced that Xiaomi will spend 200 billion yuan on research and development in the next five years, starting from 2026, and predicted 30% revenue growth this year.\n\nLei had teased the 3 nanometer chip last week on Chinese social media app Weibo. He later noted the chip is in mass production and said the company would invest at least 50 billion yuan ($6.9 billion) over the next 10 years in its own chip development.\n\nApple's iPhone 16 Pro and Pro Max use A18 Pro chips built on the same 3 nanometer process.\n\nAround 40% of Xiaomi's phones currently use chips by Qualcomm and MediaTek, according to Counterpoint Research Partner Niel Shah.\n\nXiaomi spent 13.5 billion ($1.87 billion) over four years to develop the Xring O1, Lei said in a social media post. He revealed that the company started developing chips in 2014 and unveiled one in 2017, before temporarily suspending such research.\n\nLast spring, Xiaomi launched its first electric car, the SU7 sedan, with a price $4,000 below that of Tesla's Model 3 at the time. Ford CEO Jim Farley said he spent months driving a Xiaomi electric car, as he tried to assess competition from Chinese automakers.\n\nXiaomi's first SUV, called the YU7, will be officially released in July, Lei said in a social media post, noting the car's price wouldn't be revealed Thursday. Lei did share some promotional images and car features at the event.\n\nLei said the YU7 car would use Qualcomm Snapdragon and Nvidia Thor chips. The standard version of the vehicle will come with advanced driver assist and a driving range of 835 km.\n\nThe company delivered more than 28,000 vehicles in April, down from its record of more than 29,000 during the previous month. That comes after the crash of an SU7 vehicle in China, which left three people dead. China has since required automakers to use more conservative language when advertising driver-assist systems.\n\nXiaomi is set to release its first-quarter results on May 27, after the company in March reported record revenue and net profit for 2024. Sales generated from overseas markets last year accounted for nearly 42% of total revenue.\n\nThe company's shares remain more than 50% higher year-to-date.\n\n— CNBC's Arjun Kharpal and Bernice Ooi contributed to this report.", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/22/stocks-making-the-biggest-moves-premarket-aap-snow-hum-lumn.html", "title": "Stocks making the biggest moves premarket: Advance Auto Parts, Snowflake, Humana, Lumen Technologies and more", "body": "Check out the companies making headlines before the bell: Advance Auto Parts — Shares surged more than 30% after Advance Auto Parts topped first-quarter expectations. The auto parts company posted an adjusted loss of 22 cents per share, narrower than the loss of 82 cents per share analysts polled by LSEG had anticipated. Revenue of $2.58 billion exceeded the $2.50 billion consensus estimate. Nike — The footwear stock added almost 1% after the company said it would resume sales on Amazon . Nike had previously been a \"gated\" brand on the site, which means sales were highly restricted, after the brand stopped direct sales through the e-commerce site in 2019. The company also plans to raise prices on select products . Health insurance stocks — The Centers for Medicare & Medicaid Services announced an aggressive expansion of Medicare Advantage audits sending shares of health insurers lower. Humana shares dropped more than 6%. CVS Health fell almost 4%. UnitedHealth Group declined more than 3%. Analog Devices — Shares popped 3% after the semiconductor manufacturing company beat fiscal second-quarter expectations. Analog Devices earned $1.85 per share, excluding items, on revenue of $2.64 billion. Analysts polled by FactSet anticipated earnings of $1.70 per share on revenue of $2.51 billion. Urban Outfitters — The apparel retailer soared 17% after reporting earnings of $1.16 per share in its last quarter, which exceeded the 84 cents per share analysts had forecast, per LSEG. Revenue of $1.33 billion also came in higher than the $1.29 billion Wall Street had expected. Lumen Technologies — The telecommunications stock rallied 9% after AT & T agreed to acquire substantially all of Lumen's mass markets fiber internet connectivity business. The $5.75 billion deal is set to close in the first half of 2026. Shares of AT & T were little changed. Snowflake — Shares jumped 8% after the cloud-based data storage company posted solid earnings in its first quarter. Adjusted earnings of 24 cents per share topped the 21 cents per share expected by analysts polled by LSEG. Second-quarter product revenue guidance also exceeded expectations. Sunrun – The rooftop solar installer fell more than 30% as the House Republican tax bill is worse than feared for clean energy. Solar stocks broadly sold off with Enphase and SolarEdge down more than 17%. Array Technologies was down more than 10% and Nextracker fell about 4%. First Solar was trading about 1% lower. Zoom Communications — Shares slipped less than 1% despite a first-quarter earnings beat and an upbeat forecast. Zoom earned $1.43 per share, excluding items, while analysts forecasted $1.31 a share. Revenue came in line with the Street's consensus at $1.17 billion. Pitney Bowes — Shares gained more than 9% after the shipping and mailing company said sitting director Kurt Wolf was appointed as its new chief executive. He replaces Lance Rosenzweig, who is retiring from his role as CEO but will stay on as a consultant to the company. — CNBC's Lisa Han, Alex Harring and Jesse Pound contributed reporting.", "publish_ts": 1747872000000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/21/stocks-making-the-biggest-moves-after-hours-snow-zm-urbn.html", "title": "Stocks making the biggest moves after hours: Lumen Technologies, Snowflake, Zoom Communications and more", "body": "Check out the companies making headlines after the bell : Zoom Communications — The video conferencing company saw shares rising about 1% in extended trading after the firm shared its annual revenue forecast. The company now sees fiscal 2026 revenue between $4.80 billion and $4.81 billion, compared to analyst expectation of $4.79 billion, according to FactSet. Zoom also posted higher-than-expected adjusted earnings for the last quarter. Snowflake — The cloud-based data storage company's stock surged more than 6% in after-hours trading after the company reported a solid first quarter. Adjusted earnings of 24 cents per share beat an LSEG estimate of 21 cents per share. Guidance for its second-quarter product revenue also topped Street expectations. Urban Outfitters — The apparel retailer saw shares soaring more than 9% in extended trading following a stronger-than-expected quarterly report. The firm posted an EPS of $1.16, beating a Street estimate of 84 cents, per LSEG. Revenue of $1.33 billion also came in higher than an estimate of $1.29 billion. Lumen Technologies – Shares of the communications company surged 15% after AT & T agreed to acquire substantially all of Lumen's Mass Markets fiber internet connectivity business. The $5.75 billion deal is expected to close in the first half of 2026. AT & T shares were little changed.", "publish_ts": 1747785600000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/21/stocks-making-the-biggest-moves-midday-goos-unh-tgt-cri-and-more.html", "title": "Stocks making the biggest moves midday: Canada Goose, UnitedHealth, Target, Carter's and more", "body": "Check out the companies making headlines in midday trading. Target — The big-box retailer fell 5.2% on disappointing first-quarter results . Target also cut its full-year sales outlook, partly blaming falling consumer sentiment and uncertainty about tariffs. Toll Brothers — The stock ticked down 0.5% after the homebuilder beat on both the top and bottom lines for its second quarter. Earnings came in at $3.50 per share, topping the $2.83 a share expected from analysts polled by LSEG. Revenue was $2.74 billion, versus the $2.48 billion consensus estimate. Palo Alto Networks — The cybersecurity company tumbled 6.8% after posting a gross margin for the third fiscal quarter that was lower than expected. That overshadowed an better-than-anticipated earnings report on both lines for the quarter. Canada Goose — The luxury jacket maker soared 19.6% after posting a better earnings report for the fiscal fourth quarter than analysts penciled in. However, the company said it would not provide an outlook for the fiscal 2026 year due to uncertainty tied to consumer spending and the global trade backdrop. UnitedHealth — Shares fell 5.8% following HSBC's downgrade of the health insurer. HSBC said the stock could see more downside even after the recent sell-off. UnitedHealth shares have plunged nearly 39% this year. Crypto stocks — Some stocks tied to digital currencies slid despite an earlier pop as bitcoin rallied to a new all-time high . Both Coinbase and Mara Holdings swung into the red. Carter's — Shares sank 12.6% after the children's clothing company announced it would slash its quarterly dividend to 25 cents per share from 80 cents per share. The company also said that higher tariffs could push up product costs. Xpeng — U.S.-listed shares of the Chinese electric vehicle maker surged 13% after the company recorded a s maller loss for the first quarter than anticipated. Xpeng said it plans to deliver between 102,000 and 108,000 vehicles in the current quarter, which would mark a year-over-year rise of more than 200%. Take-Two Interactive — Shares slid 4.5% after the video game maker announced a proposed offering of $1 billion in common stock. JPMorgan and Goldman Sachs are the lead bookrunning managers for the potential offering. Keysight Technologies — The commercial electronics stock shed 0.2% after results for the fiscal second quarter topped expectations. Keysight reported $1.70 in adjusted earnings per share on $1.31 billion of revenue. Analysts surveyed by FactSet were expecting $1.65 per share and $1.28 billion. Both of the company's major reporting segments saw year over year revenue growth. Modine Manufacturing — Shares dropped 11.7% despite a better-than-projected report for the fourth fiscal quarter. The manufacturer earned $1.12 per share, excluding items, while analysts polled by FactSet anticipated 96 cents a share. Revenue came in at $647.2 million, also exceeding the Street's consensus forecast of $631.5 million. — CNBC's Jesse Pound, Yun Li and Michelle Fox contributed reporting", "publish_ts": 1747785600000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/21/stocks-making-the-biggest-moves-premarket-tgt-panw-low-unh.html", "title": "Stocks making the biggest moves premarket: Target, Palo Alto Networks, Lowe's, UnitedHealth and more", "body": "Check out the companies making headlines before the bell. Palo Alto Networks — Shares of the cybersecurity company dipped 3.7% after Palo Alto Network's gross margin for the fiscal third quarter came out below estimates . The company still beat on earnings and revenue expectations, however. UnitedHealth — Shares dropped more than 6% after HSBC downgraded the health insurance giant, saying valuations are still elevated despite a recent rout. Target — The retailer's stock slipped 3.5% after Target missed first-quarter revenue estimates and cut its full-year sales outlook. Executives blamed tariff uncertainty, weaker discretionary spending and backlash to the company's rollback of key diversity, equity and inclusion efforts for its performance. Lowe's — Shares of the home improvement retailer rose 2%. Lowe's reaffirmed its full-year forecast , putting the retailer on track for year-over-year sales growth. Lowe's also reported earnings of $2.92 per share, beating an LSEG estimate of $2.88 per share. Revenue of $20.93 billion came out just shy of the $20.94 billion expected. Toll Brothers — The homebuilder rose more than 4% after fiscal second-quarter results topped expectations. Toll Brothers reported $3.50 in earnings per share on $2.74 billion in revenue. Analysts surveyed by LSEG were looking for $2.83 per share in earnings and $2.48 billion in revenue. Carter's — Shares of the children's clothing company slid about 6% after Carters cut its quarterly dividend to 25 cents per share, down from 80 cents per share. The company's chief executive said in a release that Carter's dividend was misaligned with its level of profitability against the current market environment, and that higher tariffs could lead Carter's to incur significantly higher product costs. Wolfspeed — Shares of the semiconductor supplier plunged more than 60% after The Wall Street Journal reported , citing sources familiar with the matter that Wolfspeed is preparing to file for bankruptcy within weeks. Xpeng — The Chinese EV maker rose than 5% in the premarket after a smaller-than-expected loss for the first quarter . Xpeng added it expects to deliver between 102,000 and 108,000 vehicles in the second quarter. That represents a year-over-year increase of more than 200%. — CNBC's Sarah Min and Jesse Pound contributed reporting.", "publish_ts": 1747785600000, "source": "CNBC Top News"}
{"url": "https://www.cnbc.com/2025/05/20/stocks-making-the-biggest-moves-after-hours-panw-ttwo-tol-and-more.html", "title": "Stocks making the biggest moves after hours: Palo Alto Networks, Take-Two Interactive and more", "body": "Check out the companies making headlines in extended trading. Palo Alto Networks — Shares of the cybersecurity company fell nearly 4%. Palo Alto reported remaining performance obligations — revenue it expects to receive from services yet to be delivered — of $13.5 billion in the fiscal third quarter. That came in slightly below the $13.54 billion analysts polled by StreetAccount expected. Take-Two Interactive Software — Shares slid 3% after the video game maker announced a proposed offering of $1 billion in common stock. JPMorgan and Goldman Sachs are the lead bookrunning managers for the offering. Keysight Technologies — Shares climbed 5%. The electronic test equipment manufacturer reported earnings for the fiscal second quarter that came in above Wall Street consensus forecasts. Keysight posted $1.70 per share, excluding items, on revenue of $1.31 billion, while analysts polled by LSEG had penciled in $1.65 per share and $1.28 billion in revenue. Modine Manufacturing — Shares added 2% following a stronger-than-expected earnings report for the fiscal fourth quarter. Modine posted $1.12 per share, excluding items, while analysts polled by FactSet penciled in vs 96 cents a share. Revenue came in at $647.2 million, also surpassing the Street's prediction of $631.5 million. Toll Brothers — The luxury homebuilder's shares advanced 6% after the company's earnings topped forecasts. Toll Brothers reported earnings of $3.50 per share in the second fiscal quarter, above the consensus estimate of $2.83 per share, according to LSEG. The company posted $2.71 billion in revenue versus a $2.48 billion forecast.", "publish_ts": 1747699200000, "source": "CNBC Top News"}
{"url": "https://www.ft.com/content/2c0db765-03ac-4820-8a02-806469848bee", "title": "Trump orders US chip software suppliers to stop selling to China", "body": "White House Watch newsletter Sign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\n\nTrump tracker: US tariffs As the president threatens a trade war, follow the latest on tariffs and executive orders\n\nUS politics & policy Stay on top of the latest events in US politics with the FT’s trusted and impartial coverage.", "publish_ts": 1748464933000, "source": "Financial Times Home"}
